{"text": "SECOND SECTION\n\nCASE OF MANCINI v. \n\n(Application no. 44955/98)\n\nJUDGMENT\n\nFINAL\n\nIn the case of Mancini v. ,\n\nThe European Court of Human Rights (Second Section), sitting as a Chamber composed of:\n\n\tMr\tC.L. Rozakis, President,\n\tMr\tB. Conforti,\n\tMr\tG. Bonello,\n\tMrs\tV. Strážnická,\n\tMrs\tM. Tsatsa-Nikolovska,\n\tMr\tE. Levits,\n\tMr\tA. Kovler, judges,\nand Mr E. Fribergh, Section Registrar,\n\nHaving deliberated in private on  and ,\n\nDelivers the following judgment, which was adopted on the last-mentioned date:\n\nPROCEDURE\n\n1.  The case originated in an application (no. 44955/98) against the  lodged with the European Commission of Human Rights (“the Commission”) under former Article 25 of the Convention for the Protection of Human Rights and Fundamental Freedoms (“the Convention”) by two Italian nationals, Mr Vittorio Mancini and Mr Luigi Mancini (“the applicants”), on .\n\n2.  The applicants were represented by Mr P. Iorio, a lawyer practising in . The Italian Government (“the Government”) were represented by their Agent, Mr U. Leanza, and their co-Agent, Mr V. Esposito. \n\n3.  The applicants submitted, in particular, that their detention in Rome Prison from 7 to  had been unlawful (Article 5 § 1 (c) of the Convention).\n\n4.  The application was transmitted to the Court on , when Protocol No. 11 to the Convention came into force (Article 5 § 2 of Protocol No. 11).\n\n5.  The application was allocated to the Second Section of the Court (Rule 52 § 1 of the Rules of Court). Within that Section, the Chamber that would consider the case (Article 27 § 1 of the Convention) was constituted as provided in Rule 26 § 1.\n\n6.  By a decision of , the Chamber declared the application partly admissible [Note by the Registry. The Court’s decision is obtainable from the Registry].\n\nTHE FACTS\n\nTHE CIRCUMSTANCES OF THE CASE\n\n7.  The applicants are Italian nationals who were born in 1959 and 1951 respectively and live in .\n\n8.  On 10 and  two armed robberies were committed in the  area. It emerges from a report prepared by the  police on  that there was evidence that the stolen goods had been hidden in a warehouse belonging to the company owned by the applicants. The latter were also said to have been in telephone contact with persons suspected of the offences.\n\n9.  On  the  public prosecutor applied for the applicants to be placed in pre-trial detention. In an order of , the  investigating judge allowed that application.\n\n10.  On  the applicants were arrested and taken to Rome Prison. On  they appealed against the order of  to the division of the Rome District Court responsible for reconsidering security measures (tribunale  riesame).\n\n11.  The hearing before the Rome District Court was held on . In an order delivered the same day, filed with the registry on , the court replaced the applicants’ pre-trial detention with the security measure of house arrest (arresti domiciliari). It considered, in particular, that it was reasonable to suspect that the applicants had committed the offences in issue and that it was to be feared that they might commit others of the same type. Taking the view, however, that there was no “tangible risk for the gathering of evidence” and having regard to the defendants’ clean police record, it concluded that a less restrictive measure, such as house arrest, was preferable. That measure required the applicants to stay in their home and leave only with the authorities’ prior authorisation.\n\n12.  The order of 7 January was served on the applicants on . They should therefore have been immediately escorted from Rome Prison, where they were being held, to their home. However, no police officers were available to escort them and so their transfer was delayed until .\n\nTHE LAW\n\nI.  ALLEGED VIOLATION OF ARTICLE 5 § 1 OF THE CONVENTION\n\n13.  The applicants submitted that their detention in Rome Prison from 7 to  had been unlawful. They relied on Article 5 § 1 (c) of the Convention, which provides:\n\n“1.  Everyone has the right to liberty and security of person. No one shall be deprived of his liberty save in the following cases and in accordance with a procedure prescribed by law:\n\n...\n\n(c)  the lawful arrest or detention of a person effected for the purpose of bringing him before the competent legal authority on reasonable suspicion of having committed an offence or when it is reasonably considered necessary to prevent his committing an offence or fleeing after having done so;”\n\n14.  The Government asserted that even if it had to be carried out in a different place, house arrest was a measure which, like detention, entailed a deprivation of liberty; that being so, the delay in the applicants’ transfer could not have resulted in a breach of Article 5 of the Convention.\n\n15.  The applicants rejected the Government’s argument, contending that their right to freedom was inviolable and should not be restricted as a result of organisational shortcomings attributable to the State.\n\n16.  The Court points out that in proclaiming the “right to liberty”, paragraph 1 of Article 5 contemplates the physical liberty of the person; its aim is to ensure that no one should be deprived of this liberty in an arbitrary fashion (see Guzzardi v. Italy, judgment of 6 November 1980, Series A no. 39, p. 33, § 92, and Amuur v. France, judgment of 25 June 1996, Reports of Judgments and Decisions 1996-III, p. 848, § 42). Article 5 § 1 does not, however, regulate conditions of detention (see D. v. Germany, no. 11703/85, Commission decision of 9 December 1987, Decisions and Reports 54, p. 116) and does not guarantee the right to be placed in a more lenient form of detention than a traditional prison regime.\n\n17.  In the instant case, in view of their effects and their manner of implementation, both imprisonment and house arrest amounted to a deprivation of the applicants’ liberty for the purposes of Article 5 § 1 (c) of the Convention. The present case therefore concerns the delay in substituting for detention in prison a more lenient security measure. Accordingly, it is clearly distinguished from other cases dealt with by the Court in which a breach of Article 5 of the Convention was found because the release of an applicant had been delayed (see, for instance, Quinn v. France, judgment of 22 March 1995, Series A no. 311, pp. 17-18, § 42).\n\n18.  The Court would also point out that, in Ashingdane v. the United Kingdom (judgment of 28 May 1985, Series A no. 93, pp. 19-22, §§ 39-50), it was asked to rule on the nineteen-month-long failure to implement the applicant’s transfer from the “special” psychiatric hospital of Broadmoor to an ordinary psychiatric hospital in Oakwood, which provided a different and more liberal regime of hospital detention. Noting that the place and conditions of detention had not ceased to be those capable of accompanying “the lawful detention of a person of unsound mind”, and that the applicant’s right to liberty had not been limited to a greater extent than that provided for in the Convention, the Court held that the injustice suffered by Mr Ashingdane was not a mischief against which Article 5 § 1 of the Convention afforded protection.\n\n19.  The Court finds, however, that there are major differences between Ashingdane and the present situation. Although it is true that under certain circumstances transfer from one psychiatric hospital to another may result in a significant improvement in the patient’s overall situation, the fact remains that such a transfer in no way alters the type of deprivation of liberty to which an applicant is subjected. The same cannot be said of replacing detention in prison with house arrest because this entails a change in the nature of the place of detention from a public institution to a private home. Unlike house arrest, detention in prison requires integration of the individual into an overall organisation, sharing of activities and resources with other inmates, and strict supervision by the authorities of the main aspects of his day-to-day life.\n\n20.  In the light of the foregoing, the Court considers that the situation complained of by the applicants falls within the scope of Article 5 § 1 (c) of the Convention. The Court must therefore examine whether that provision was complied with in the instant case.\n\n21.  The applicants observed that in its order of  the Rome District Court had replaced their pre-trial detention with the security measure of house arrest. However, owing to the absence of the requisite police officers – and hence to an organisational shortcoming that was attributable to the State – they had not been able to leave Rome Prison until . They submitted therefore that they had been unlawfully detained for about six days.\n\n22.  The Government pointed out that, on the date in question, the police officers who should have escorted the applicants to their home had been assigned to other tasks to be carried out in the public interest. Moreover, the order of  had only been served on the applicants on 10 January, and so it was only from that date on that the more lenient form of deprivation of liberty should have been applied.\n\n23.  The Court reiterates that the list of exceptions to the right to liberty secured in Article 5 § 1 is an exhaustive one and only a narrow interpretation of those exceptions is consistent with the aim of that provision (see, among many other authorities, Van der Leer v. the Netherlands, judgment of 21 February 1990, Series A no. 170-A, p. 12, § 22, and Wassink v. the Netherlands, judgment of 27 September 1990, Series A no. 185-A, p. 11, § 24).\n\n24.  It acknowledges that some delay in carrying out a decision to release a detainee is understandable and often inevitable. However, the national authorities must attempt to keep it to a minimum (see Giulia Manzoni v. Italy, judgment of , Reports 1997-IV, p. 1191, § 25).\n\n25.  The Court points out that in Quinn (cited above, pp. 17-18, §§ 39-43), it found that a delay of eleven hours in executing a decision to release the applicant “forthwith” was incompatible with Article 5 § 1 of the Convention. Its finding must be the same in the present case, where the applicants’ transfer from Rome Prison to their home was delayed for at least three days.\n\n26.  There has accordingly been a violation of Article 5 § 1 of the Convention.\n\nII.  APPLICATION OF ARTICLE 41 OF THE CONVENTION\n\n27.  Article 41 of the Convention provides:\n\n“If the Court finds that there has been a violation of the Convention or the Protocols thereto, and if the internal law of the High Contracting Party concerned allows only partial reparation to be made, the Court shall, if necessary, afford just satisfaction to the injured party.”\n\n28.  After the application had been declared admissible, the applicants made no claim for just satisfaction within the time allowed them for that purpose. On the other hand, they had stated in the application form that they hoped to be awarded 500,000,000 Italian lire, to cover the prejudice suffered as a result of all the alleged violations, including those raised in complaints that were subsequently declared inadmissible.\n\n29.  That being so, the Court considers that the applicants failed to comply with their obligations under Rule 60 of the Rules of Court. Since no valid claim for just satisfaction has been made, the Court considers that there is no reason to award the applicants any amount under that head.\n\nFOR THESE REASONS, THE COURT\n\nHolds by four votes to three that there has been a violation of Article 5 § 1 of the Convention.\n\nDone in French, and notified in writing on , pursuant to Rule 77 §§ 2 and 3 of the Rules of Court.\n\n\tErik Fribergh\tChristos Rozakis\n\tRegistrar\tPresident\n\nIn accordance with Article 45 § 2 of the Convention and Rule 74 § 2 of the Rules of Court, the dissenting opinion of Mr Conforti joined by Mr Levits and Mr Kovler, is annexed to this judgment.\n\nC.L.R.\nE.F.\n\n\nDISSENTING OPINION OF JUDGE CONFORTI \nJOINED BY JUDGES LEVITS AND KOVLER\n\n(Translation)\n\nI regret that I cannot concur with the majority in this case. Whilst I do not find the position adopted by the Court in Ashingdane very convincing and think that it may merit some reappraisal, I find it difficult to agree that there are substantial differences between Ashingdane and the present case. In my opinion it is the analogies between the two cases that are important, the differences being insignificant. The crucial point is that in both cases there was a transition from a stricter form of detention to a more liberal one. In both cases therefore the detention did not cease to be – to use the words of the Court in Ashingdane – a “lawful detention” entailing any greater limitations than those provided for under Article 5 § 1 (c) of the Convention (see Ashingdane v. the United Kingdom, judgment of 28 May 1985, Series A no. 93, pp. 2122, § 47). This being so, I do not think it is possible to find that there has been a violation of the Convention."}