{"text": "GRAND CHAMBER\n\nCASE OF SCORDINO v.  (No. 1)\n\n(Application no. 36813/97)\n\nJUDGMENT\n\nIn the case of Scordino v.  (no. 1),\n\nThe European Court of Human Rights, sitting as a Grand Chamber composed of:\n\n\tLuzius Wildhaber, President,\n\tChristos Rozakis,\n\tJean-Paul Costa,\n\tNicolas Bratza,\n\tBoštjan M. Zupančič,\n\tLucius Caflisch,\n\tCorneliu Bîrsan,\n\tKarel Jungwiert,\n\tMatti Pellonpää,\n\tMargarita Tsatsa-Nikolovska,\n\tRait Maruste,\n\tStanislav Pavlovschi,\n\tLech Garlicki,\n\tAlvina Gyulumyan,\n\tEgbert Myjer,\n\tSverre Erik Jebens, judges,\n\tMariavaleria del Tufo, ad hoc judge,\nand Lawrence Early, Deputy Grand Chamber Registrar,\n\nHaving deliberated in private on  and 18 January 2006,\n\nDelivers the following judgment, which was adopted on the last-mentioned date:\n\nPROCEDURE\n\n1.  The case originated in an application (no. 36813/97) against the  lodged with the European Commission of Human Rights (“the Commission”) under former Article 25 of the Convention for the Protection of Human Rights and Fundamental Freedoms (“the Convention”) by four Italian nationals, Giovanni, Elena, Maria and Giuliana Scordino (“the applicants”), on .\n\n2.  Having originally been designated by the initials G.S. and Others, the applicants subsequently agreed to the disclosure of their names. They were represented before the Court by Mr N. Paoletti, of the Rome Bar. The Italian Government (“the Government”) were represented by their Agent, Mr I.M. Braguglia, their co-Agent, Mr F. Crisafulli, and their Deputy co-Agent, Mr N. Lettieri.\n\n3.  Under Article 1 of Protocol No. 1 and Article 6 of the Convention the applicants alleged that there had been an unjustified interference with their right to the peaceful enjoyment of their possessions and a breach of their right to a fair hearing within a reasonable time.\n\n4.  The application was transmitted to the Court on , when Protocol No. 11 to the Convention came into force (Article 5 § 2 of Protocol No. 11).\n\n5.  The application was allocated to the First Section of the Court (Rule 52 § 1 of the Rules of Court). Vladimiro Zagrebelsky, the judge elected in respect of , withdrew from sitting in the case (Rule 28). The Government accordingly appointed Mariavaleria del Tufo to sit as an ad hoc judge (Article 27 § 2 of the Convention and Rule 29 § 1).\n\n6.  On 27 March 2003, after a hearing on the admissibility and merits (Rule 54 § 3), the application was declared admissible by a Chamber of the First Section, composed of Christos Rozakis, President, Giovanni Bonello, Peer Lorenzen, Nina Vajić, Snejana Botoucharova, Elisabeth Steiner, judges, Mariavaleria del Tufo, ad hoc judge, and Søren Nielsen, Deputy Section Registrar.\n\n7.  In its judgment of 29 July 2004 (“the Chamber judgment”), the Chamber decided, unanimously, to dismiss the Government’s preliminary objection and held unanimously that there had been a violation of Article 6 § 1 of the Convention on account of the length and unfairness of the proceedings. It also held that there had been a violation of Article 1 of Protocol No. 1 on account of an unjustified interference with the applicants’ right to the peaceful enjoyment of their possessions.\n\n8.  On 26 October 2004 the Government requested, in accordance with Article 43 of the Convention and Rule 73, that the case be referred to the Grand Chamber. On  a panel of the Grand Chamber accepted that request.\n\n9.  The composition of the Grand Chamber was determined in accordance with the provisions of Article 27 §§ 2 and 3 of the Convention and Rule 24.\n\n10.  The applicants and the Government each filed a memorial. In addition, third-party comments were received from the Polish, Czech and Slovakian Governments, which had been given leave by the President to intervene in the written procedure (Article 36 § 2 of the Convention and Rule 44 § 2). The applicants replied to those comments (Rule 44 § 5).\n\n11.  A hearing took place in public in the   , , on  (Rule 59 § 3).\n\nThere appeared before the Court:\n\n(a)  for the Government\nMr\tN. Lettieri, \tDeputy co-Agent;\n\n(b)  for the applicants\n\nMr\t, \tCounsel,\n\nMrs\tA. Mari,\n\nMrs\tG. Paoletti, all of the Rome Bar,\tAdvisers.\n\nThe Court heard addresses by Mr Paoletti, Mrs Mari and Mr Lettieri, and Mr Lettieri’s replies to judges’ questions.\n\nTHE FACTS\n\nI.  THE CIRCUMSTANCES OF THE CASE\n\n12.  The applicants were born in 1959, 1949, 1951 and 1953 respectively and live in .\n\n13.  In 1992 the applicants inherited from Mr A. Scordino several plots of land in , entered in the land register as folio 111, parcels 105, 107, 109 and 662. On  Reggio di Calabria District Council had adopted a general development plan, which was approved by the Calabria Regional Council on . The land in issue in the present application, an area of 1,786 sq. m designated as parcel 109, was made the subject of an expropriation permit under the general development plan with a view to the construction of housing on the land. The land was subsequently included in the zonal development plan approved by the Calabria Regional Council on .\n\nA.  The expropriation of the land\n\n14.  In 1980 Reggio di Calabria District Council decided that a cooperative society, Edilizia Aquila, would carry out building work on the land in question. In a decision of 13 March 1981, the administrative authorities granted the cooperative permission to occupy the land.\n\n15.  On , pursuant to Law no. 385/1980, Reggio di Calabria District Council offered an advance on the compensation payable for the expropriation, the amount having been determined in accordance with Law no. 865/1971. The sum offered, 606,560 Italian lire (ITL), was calculated according to the rules in force for agricultural land, using a value of ITL 340 per square metre as a basis, with the proviso that the final amount of compensation would be determined once a law had been enacted laying down new compensation criteria for building land.\n\n16.  The offer was refused by Mr A. Scordino.\n\n17.  On  the Regional Council issued an expropriation order in respect of the land.\n\n18.  On  the District Council made a second offer of an advance, this time amounting to ITL 785,000. The offer was not accepted.\n\n19.  In judgment no. 223 of , the  declared Law no. 385/1980 unconstitutional on the ground that it made the award of compensation subject to the enactment of a future law.\n\n20.  As a result of that judgment, Law no. 2359/1865, which provided that compensation for expropriation should correspond to the market value of the land in question, came back into force.\n\n21.  On  Mr A. Scordino served formal notice on the District Council to determine the final amount of compensation in accordance with Law no. 2359/1865. On 16 November 1989 he learned that Reggio di Calabria District Council had assessed the final amount at ITL 88,414,940 (ITL 50,000 per square metre) in an order of 6 October 1989.\n\nB.  Proceedings for the award of compensation for the expropriation\n\n22.  On 25 May 1990, contesting the amount of compensation he had been awarded, Mr A. Scordino brought proceedings against the District Council and the cooperative in the Reggio di Calabria Court of Appeal.\n\n23.  He argued that the amount determined by the District Council was ridiculously low in relation to the market value of the land and requested, among other things, to have the compensation calculated in accordance with Law no. 2359/1865. He also sought compensation for the period during which the land had been occupied before the expropriation order had been issued, and for the area of land (1,500 sq. m) that had become unusable as a result of the building work.\n\n24.  Preparation of the case for hearing began on .\n\n25.  The cooperative gave notice of its intention to defend and raised an objection, arguing that it could not be considered a party to the proceedings.\n\n26.  On 4 February 1991, as the District Council had still not given notice of its intention to defend, the  Court of Appeal declared it to be in default and ordered an expert assessment of the land. By an order of 13 February 1991, an expert was appointed and was given three months in which to submit his report.\n\n27.  On  the District Council gave notice of its intention to defend and raised an objection, arguing that it could not be considered a party to the proceedings. The expert agreed to his terms of reference and was sworn in.\n\n28.  On  the expert submitted a report.\n\n29.  On  Law no. 359 of  (“Urgent measures aimed at stabilising public finances”) came into force. Section 5 bis of the Law laid down new criteria for calculating compensation for the expropriation of building land. The Law was expressly applicable to pending proceedings.\n\n30.  Mr A. Scordino died on . On  the applicants declared their intention to continue the proceedings.\n\n31.  On  the  Court of Appeal appointed another expert and instructed him to assess the compensation for the expropriation according to the new criteria laid down in section 5 bis of Law no. 359/1992.\n\n32.  The expert submitted his report on 24 March 1994, concluding that the land’s market value on the date of the expropriation had been ITL 165,755 per square metre. In accordance with the new criteria laid down in section 5 bis of Law no. 359/1992, the compensation due was ITL 82,890 per square metre.\n\n33.  At a hearing on 11 April 1994, the parties asked for time to submit comments on the expert’s report. Counsel for the applicants produced a separate expert opinion and observed that the expert appointed by the court had omitted to calculate the compensation for the 1,500 sq. m of land that was not covered by the expropriation order but had become unusable as a result of the building work.\n\n34.  A hearing was held on  at which observations were submitted in reply. The next hearing, scheduled for , was adjourned by the court of its own motion until  and then until .\n\n35.  By an order of 29 December 1994, the court ordered a further expert assessment and adjourned the proceedings until 6 March 1995. However, the hearing was subsequently adjourned on several occasions as the investigating judge was unavailable. At the applicants’ request, the investigating judge was replaced on  and the parties made their submissions at a hearing on .\n\n36.  In a judgment of 17 July 1996, the Reggio di Calabria Court of Appeal held that the applicants were entitled to compensation calculated according to section 5 bis of Law no. 359/1992, both for the land that had been formally expropriated and for the land that had become unusable as a result of the building work. It also held that the compensation thus determined should not be subject to the further 40% statutory deduction applicable where the owner of the expropriated land had not signed an agreement for its transfer (cessione volontaria), seeing that in the applicants’ case the land had already been expropriated when the Law had come into force.\n\n37.  In conclusion, the Court of Appeal ordered the District Council and the cooperative to pay the applicants:\n\n(a)  ITL 148,041,540 (ITL 82,890 per square metre for 1,786 sq. m of land) in compensation for the expropriation;\n\n(b)  ITL 91,774,043 (ITL 75,012.50 per square metre for 1,223.45 sq. m) in compensation for the part of the land that had become unusable and was to be regarded as having been de facto expropriated; and\n\n(c)  compensation for the period during which the land had been occupied prior to its expropriation.\n\n38.  Those amounts were to be index-linked and subject to interest until the date of settlement.\n\n39.  On  the cooperative appealed on points of law, arguing that it could not be considered a party to the proceedings. On 20 and  respectively the applicants and the District Council likewise appealed.\n\nOn  the cooperative applied for a stay of execution of the Court of Appeal’s judgment. That application was dismissed on 8 August 1997.\n\n40.  In a judgment of 3 August 1998, deposited with the registry on 7 December 1998, the Court of Cassation allowed the cooperative’s appeal, acknowledging that it was not a party to the proceedings as it had not formally been a party to the expropriation, although it had benefited from it. It upheld the remainder of the  Court of Appeal’s judgment.\n\n41.  In the meantime, on , the amount awarded by the Court of Appeal had been deposited at the National Bank. On 30 September 1997 tax was deducted from it at a rate of 20% in accordance with Law no. 413/1991.\n\nC.  The “Pinto” proceedings\n\n42.  On  the applicants applied to the  Court of Appeal under Law no. 89 of 24 March 2001, known as the “Pinto Act”, complaining about the excessive length of the above-ded proceedings.\n\nThe applicants asked the court to find that there had been a violation of Article 6 § 1 of the Convention and order the Italian State and the Ministry of Justice to compensate them for non-pecuniary damage, which they assessed at 50,000 euros (EUR), and the pecuniary damage that they considered they had sustained as a result of the application of Law no. 359/1992 to their case.\n\n43.  In a decision of 1 July 2002, deposited with the registry on 27 July 2002, the  Court of Appeal found that the length of the proceedings had been excessive. It held as follows:\n\n“... The proceedings began on  and ended on . They were conducted at two levels of jurisdiction and were not particularly complex.\n\nIt can be seen from the case-law of the European Court of Human Rights that three years is deemed to be an acceptable period for proceedings at first instance and two years at second instance.\n\nThe applicants declared their intention to continue the proceedings as the heirs of Mr A. Scordino, who died in 1992, when a reasonable time had not yet been exceeded.\n\nAccordingly, the delays must be calculated only in respect of the subsequent period, and amount to three years and six months.\n\nIt is not the applicants who are responsible for the delay, but rather the malfunctioning of the judicial system.\n\nThe pecuniary damage alleged by the applicants has not been caused by the length of the proceedings and cannot therefore be compensated.\n\nHaving regard to the foregoing, the applicants are entitled only to compensation for the non-pecuniary damage they have sustained on account of the length of the proceedings, that is, the prolonged uncertainty regarding the outcome of the proceedings and the distress generally experienced as a result of that uncertainty.\n\nIn view of what was at stake, the amount to be awarded for non-pecuniary damage is EUR 2,450.”\n\n44.  The Court of Appeal ordered the Ministry of Justice to pay the applicants a total sum of EUR 2,450 for non-pecuniary damage alone. With regard to the government, the Court of Appeal considered that they could not be considered as a party to the proceedings.\n\n45.  Regarding the apportionment of the legal costs, the Court of Appeal ordered the Ministry of Justice to pay EUR 1,500 and the applicants to pay the remaining EUR 1,500.\n\n46.  The applicants did not appeal to the Court of Cassation. The Court of Appeal’s decision became final on .\n\nII.  RELEVANT DOMESTIC LAW AND PRACTICE\n\nA.  The expropriation\n\n47.  Section 39 of Law no. 2359/1865 provided that, where land was expropriated, the compensation to be paid should correspond to its market value at the time of the expropriation.\n\n48.  Article 42 of the Constitution, as interpreted by the Constitutional Court (see, inter alia, judgment no. 138 of ), guarantees the payment of compensation for expropriation, in an amount lower than the market value of the land.\n\n49.  Law no. 865/1971 (supplemented by section 4 of Legislative Decree no. 115/1974, which subsequently became Law no. 247/1974, and by section 14 of Law no. 10/1977) laid down new criteria: compensation for any land, whether it was agricultural or building land, should be paid as though it were agricultural land.\n\n50.  In judgment no. 5 of 25 January 1980, the  declared Law no. 865/1971 unconstitutional on the ground that it afforded the same treatment to two very different situations by providing for the same form of compensation for building and agricultural land.\n\n51.  The scope of a decision of the  declaring a law illegal is not limited to the case in question but is erga omnes. It is of retrospective effect in that the law declared unconstitutional can no longer produce any effects or be applied from the day after the publication of the decision (Article 136 of the Constitution taken in conjunction with section 1 of Constitutional Act no. 1 of 1948 and section 30(3) of Law no. 87/1953).\n\nThe  has often made explicit the retrospective effect of declarations of unconstitutionality (see, inter alia, judgment no. 127 of 15 December 1966). It has indicated in this connection that a declaration of unconstitutionality can be equated with a straightforward annulment, since it makes the law in question unconstitutional from the time of its entry into force, annuls it and makes it inapplicable to any non-final situation (and to the final situations defined by law). Furthermore, no one at all, in particular the courts, may rely on provisions that have been declared unconstitutional to assess a given situation, even if that situation arose prior to the declaration of unconstitutionality (see, on this point, judgment no. 49 of  and decisions no. 271 of 1985, no. 329 of 1985 and no. 94 of 1986).\n\nA similar decision has been given by the Court of Cassation, declaring that “where a law has been declared unconstitutional it cannot in any circumstances be applied, given that it must be considered as having never existed, and that a decision declaring a law unconstitutional has a retrospective effect regarding any non-final situation” (Court of Cassation, Section II, 23 June 1979; Section V, 15 June 1992).\n\n52.  When the  declares a law unconstitutional the provisions that had previously been applicable come back into force (reviviscenza), unless they have also been declared unconstitutional.\n\n53.  After judgment no. 5/1980 had declared Law no. 865/1971 unconstitutional, Parliament enacted Law no. 385 of 29 July 1980, which reaffirmed, but this time on a provisional basis, the criteria that had been declared unconstitutional. The Law provided that compensation should be paid in the form of an advance, to be supplemented by a payment calculated on the basis of a subsequent law that would lay down specific compensation criteria for building land.\n\n54.  In judgment no. 223 of 15 July 1983, the  declared Law no. 385/1980 unconstitutional on the ground that it made the award of compensation for the expropriation of building land subject to the enactment of a future law and that it reintroduced – even if only on a provisional basis – compensation criteria that had been declared unconstitutional. In that connection the  reiterated that the legislature had to accept that a law that had been declared illegal stopped producing its effects immediately, and stressed the need to draw up provisions for substantial awards of compensation for expropriation (serio ristoro).\n\n55.  As a result of judgment no. 223 of 1983, section 39 of Law no. 2359/1865 came back into force. Consequently, the compensation payable for building land was to correspond to the land’s market value (see, for example, Court of Cassation, Section I, judgment no. 13479 of 13 December 1991; Section I, judgment no. 2180 of ; and plenary court, judgment no. 3815 of ).\n\n56.  Section 5 bis of Law no. 359 of 8 August 1992 introduced a “temporary, exceptional and urgent” measure aimed at stabilising public finances, to remain valid until structural measures were adopted. That provision applied to any expropriation under way and to any pending proceedings related thereto. Section 5 bis of Law no. 359/1992, which was published in the Official Gazette on , came into force on .\n\n57.  Section 5 bis provides that the compensation payable for the expropriation of building land is to be calculated using the following formula: market value of the land plus the total of annual ground rent multiplied by the last ten years, divided by two, minus a 40% deduction.\n\n58.  In such cases, the compensation corresponds to 30% of the market value. That amount is subject to tax, deducted at source at a rate of 20% (in accordance with section 11 of Law no. 413/1991).\n\n59.  The 40% deduction can be avoided if the basis for the expropriation is not an expropriation order but a “voluntary agreement” for the transfer of the land or, as in the instant case, if the expropriation took place before section 5 bis came into force (see the Constitutional Court’s judgment no. 283 of 16 June 1993). In such cases, the resulting compensation corresponds to 50% of the market value. Again, that amount is subject to tax at a rate of 20% (see paragraph 58 above).\n\n60.  The Constitutional Court has held section 5 bis of Law no. 359/1992 and its retrospective application to be compatible with the Constitution (judgment no. 283 of 16 June 1993, and judgment no. 442 of 16 December 1993) on account of the urgent and temporary nature of the Law.\n\n61.  The Code of Expropriation Provisions (Presidential Decree no. 327/2001, subsequently modified by Legislative Decree no. 302/2002), which came into force on , codified the existing provisions and the principles established by the relevant case-law in respect of expropriation.\n\nArticle 37 of the Code reiterates the main criteria for calculating compensation for expropriation set forth in section 5 bis of Law no. 359/1992.\n\nB.  The complaint concerning the length of the proceedings\n\n1.  Law no. 89 of 24 March 2001 (the “Pinto Act”)\n\n62.  Award of just satisfaction in the event of a breach of the requirement to dispose of proceedings within a reasonable time and amendment to Article 375 of the Code of Civil Procedure\n\nChapter II – Just satisfaction\n\nSection 2 – Entitlement to just satisfaction\n\n“(1)  Anyone sustaining pecuniary or non-pecuniary damage as a result of a violation of the Convention for the Protection of Human Rights and Fundamental Freedoms, ratified by Law no. 848 of 4 August 1955, on account of a failure to comply with the ‘reasonable time’ requirement in Article 6 § 1 of the Convention, shall be entitled to just satisfaction.\n\n(2)  In determining whether there has been a violation, the court shall have regard to the complexity of the case and, in the light thereof, the conduct of the parties and of the judge deciding procedural issues, and also the conduct of any authority required to participate in or contribute to the resolution of the case.\n\n(3)  The court shall assess the quantum of damage in accordance with Article 2056 of the Civil Code and shall apply the following rules:\n\n(a)  only damage attributable to the period beyond the reasonable time referred to in subsection (1) may be taken into account;\n\n(b)  in addition to the payment of a sum of money, reparation for non-pecuniary damage shall be made by giving suitable publicity to the finding of a violation.”\n\nSection 3 – Procedure\n\n“(1)  Claims for just satisfaction shall be lodged with the court of appeal in which the judge sits who has jurisdiction under Article 11 of the Code of Criminal Procedure to try cases concerning members of the judiciary in the district where the case in which the violation is alleged to have occurred was decided or discontinued at the merits stage or is still pending.\n\n(2)  The claim shall be made on an application lodged with the registry of the court of appeal by a lawyer holding a special authority containing all the information prescribed by Article 125 of the Code of Civil Procedure.\n\n(3)  The application shall be made against the Minister of Justice where the alleged violation has taken place in proceedings in the ordinary courts, the Minister of Defence where it has taken place in proceedings before the military courts and the Finance Minister where it has taken place in proceedings before the tax commissioners. In all other cases, the application shall be made against the Prime Minister.\n\n(4)  The court of appeal shall hear the application in accordance with Articles 737 et seq. of the Code of Civil Procedure. The application and the order setting the case down for hearing shall be served by the applicant on the defendant authority at its elected domicile at the offices of State Counsel [Avvocatura dello Stato] at least fifteen days prior to the date of the hearing before the Chamber.\n\n(5)  The parties may apply to the court for an order for production of all or part of the procedural and other documents from the proceedings in which the violation referred to in section 2 is alleged to have occurred and they and their lawyers shall be entitled to be heard by the court in private if they attend the hearing. The parties may lodge memorials and documents up until five days before the date set for the hearing or until expiry of the time allowed by the court of appeal for that purpose on an application by the parties.\n\n(6)  The court shall deliver a decision within four months after the application is lodged. An appeal shall lie to the Court of Cassation. The decision shall be enforceable immediately.\n\n(7)  To the extent that resources permit, payment of compensation to those entitled shall commence on .”\n\nSection 4 – Time-limits and procedures for lodging applications\n\n“A claim for just satisfaction may be lodged while the proceedings in which the violation is alleged to have occurred are pending or within six months from the date when the decision ending the proceedings becomes final. Claims lodged after that date shall be time-barred.”\n\nSection 5 – Communications\n\n“If the court decides to allow an application, its decision shall be communicated by the registry to the parties, to State Counsel at the Court of Audit to enable him to start an investigation into liability, and to the authorities responsible for deciding whether to institute disciplinary proceedings against the civil servants involved in the proceedings in any capacity.”\n\nSection 6 – Transitional provisions\n\n“(1)  Within six months after the entry into force of this Act, anyone who has lodged an application with the European Court of Human Rights in due time complaining of a violation of the ‘reasonable time’ requirement contained in Article 6 § 1 of the Convention for the Protection of Human Rights and Fundamental Freedoms, ratified by Law no. 848 of 4 August 1955, shall be entitled to lodge a claim under section 3 hereof provided that the application has not by then been declared admissible by the European Court. In such cases, the application to the court of appeal must state when the application to the said  was made.\n\n(2)  The registry of the relevant court shall inform the Minister for Foreign Affairs without delay of any claim lodged in accordance with section 3 and within the period laid down in subsection (1) of this section.”\n\nSection 7 – Financial provisions\n\n“(1)  The financial cost of implementing this Act, which is put at 12,705,000,000 Italian lire from 2002, shall be met by releasing funds entered in the three-year budget 2001-03 in the chapter concerning the basic current-liability estimates from the ‘special fund’ in the year 2001 forecast of the Ministry of the Treasury, Economy and Financial Planning. Treasury deposits shall be set aside for that purpose.\n\n(2)  The Ministry of the Treasury, Economy and Financial Planning is authorised to make the appropriate budgetary adjustments by decree.”\n\n2.  Extracts from Italian case-law\n\n(a)  The departure from precedent of 2004\n\n63.  On appeal from decisions delivered by the courts of appeal in “Pinto” proceedings, the Court of Cassation, sitting as a full court (Sezioni Unite), gave four judgments (nos. 1338, 1339, 1340 and 1341) of 27 November 2003, the texts of which were deposited with the registry on 26 January 2004, quashing the appeal court’s decision and remitting the case for a rehearing. It held that “the case-law of the  is binding on the Italian courts regarding the application of Law no. 89/2001”.\n\nIn its judgment no. 1340 it affirmed, inter alia, the principle that\n\n“the court of appeal’s determination of non-pecuniary damage in accordance with section 2 of Law no. 89/2001, although inherently based on equitable principles, must be made in a legally defined framework since reference has to be made to the amounts awarded, in similar cases, by the . Some divergence is permissible, within reason”.\n\n64.  Extracts from the plenary Court of Cassation’s judgment no. 1339 deposited with the registry on 26 January 2004 read as follows:\n\n“2.  The present application poses the fundamental question of what legal effect must be given – in implementing Law no. 89 of 24 March 2001, and in particular in determining the non-pecuniary damage arising out of the breach of the reasonable length of proceedings requirement – to the judgments of the European Court of Human Rights, whether considered generally as interpretative guidelines which the said Court has laid down with regard to the consequences of the said violation, or with reference to a specific case in which the European Court has already had occasion to give a judgment on the delay in reaching a decision. ...\n\nAs stipulated in section 2(1) of the said Law, the legal fact which gives rise to the right to the just satisfaction that it provides for is constituted by the ‘violation of the Convention for the Protection of Human Rights and Fundamental Freedoms, ratified by Law no. 848 of 4 August 1955, on account of a failure to comply with the “reasonable time” requirement in Article 6 § 1 of the Convention’. In other words, Law no. 89/2001 identifies the fact constituting the right to compensation by reference to a specific provision of the European Convention on Human Rights. This Convention instituted a Court (the European Court of Human Rights, with its seat in ) to ensure compliance with the provisions contained therein (Article 19). Accordingly, the competence of the said Court to determine, and therefore to interpret, the significance of the said provisions must be recognised.\n\nAs the fact constituting the right conferred by Law no. 89/2001 consists of a violation of the Convention, it is for the Strasbourg Court to determine all the elements of such a legal fact, which thus ends by being ‘brought into conformity’ by the Court, whose case-law is binding on the Italian courts in so far as the application of Law no. 89/2001 is concerned.\n\nIt is not necessary therefore to pose the general problem of the relationships between the Convention and the internal judicial system, which the Advocate-General [Procuratore Generale] has amply discussed in court. Whatever opinion one may have about that controversial issue and therefore about the place of the Convention in the context of the sources of domestic law, it is certain that the direct implementation in the Italian judicial system of a provision of the Convention, established by Law no. 89/2001 (that is, by Article 6 § 1 in the part relating to ‘reasonable time’), cannot diverge from the interpretation which the European Court gives to the same provision.\n\nThe opposite argument, which would permit a substantial divergence between the application accorded to Law no. 89/2001 in the national system and the interpretation given by the Strasbourg Court to the right to the reasonable length of proceedings, would deprive the said Law no. 89/2001 of any justification and cause the Italian State to violate Article 1 of the Convention, according to which ‘The High Contracting Parties shall secure to everyone within their jurisdiction the rights and freedoms defined in Section I of this Convention’ (including the said Article 6, which provides for the right to have a case decided within a reasonable time).\n\nThe reason behind the enactment of Law no. 89/2001 was the need to provide a domestic judicial remedy against violations in respect of the duration of proceedings, so as to give effect to the subsidiary character of intervention on the part of the Strasbourg Court, expressly provided for by the Convention (Article 35: ‘The Court may only deal with the matter after all domestic remedies have been exhausted ...’). The European system for the protection of human rights is founded on the said principle of subsidiarity. From it derives the duty of the States which have ratified the Convention to guarantee to individuals the protection of the rights recognised by the Convention, above all in their own internal order and vis-à-vis the organs of the national judicial system. And this protection must be ‘effective’ (Article 13 of the Convention), that is, of a kind to remedy the claim without the need for recourse to the .\n\nThe domestic remedy introduced by Law no. 89/2001 did not previously exist in the Italian system, with the consequence that applications against  in respect of a violation of Article 6 of the Convention had ‘clogged’ (the term used by rapporteur Follieri in the sitting of the Senate of 28 September 2000) the . The  observed, prior to Law no. 89/2001, that the said failures on the part of  to comply ‘reflect a continuing situation that has not yet been remedied and in respect of which litigants have no domestic remedy. This accumulation of breaches accordingly constitutes a practice that is incompatible with the Convention’ (see the four judgments of the Court delivered on 28 July  Bottazzi, Di Mauro, Ferrari and A.P.).\n\nLaw no. 89/2001 constitutes the domestic remedy to which a ‘victim of a violation’ (as defined by Article 34 of the Convention) of Article 6 (failure to comply with the reasonable-time requirement) must have recourse before applying to the European Court to claim the ‘just satisfaction’ provided for in Article 41 of the Convention, which, when the violation exists, is only awarded by the Court ‘if the internal law of the High Contracting Party concerned allows only partial reparation to be made’. Law no. 89/2001 has therefore allowed the European Court to declare inadmissible applications lodged with it (including before the Act was passed) and aimed at obtaining the just satisfaction provided for in Article 41 of the Convention for the excessive length of proceedings (see Brusco v. Italy, decision of 6 September 2001).\n\nThis mechanism for implementation of the Convention and observance of the principle of subsidiarity in respect of interventions of the European Court of Strasbourg does not operate, however, in cases in which the Court holds that the consequences of the established violation of the Convention have not been redressed by domestic law or that this has been done only ‘partially’, because in such an event the said Article 41 provides for the intervention of the European Court to protect the ‘victim of the violation’. In such cases an individual application to the  on the basis of Article 34 of the Convention is admissible (see Scordino v. Italy, decision of ) and the Court acts directly to protect the rights of the victim whom it considers not to have been adequately protected by domestic law.\n\nThe judge of the adequacy or inadequacy of the protection that the victim has had from domestic law is, obviously, the European Court, whose duty it is to apply Article 41 of the Convention to ascertain whether, in the presence of a violation of a provision of the Convention, the internal law has been able to redress fully the consequences of this violation.\n\nThe argument whereby, in applying Law no. 89/2001, the Italian courts may follow a different interpretation from that which the European Court has given to the provisions of Article 6 of the Convention (violation of which is the fact giving entitlement to the right to compensation attributed by the said national law) implies that the victim of the violation, if he or she receives reparation at national level considered inadequate by the European Court, must obtain the just satisfaction provided for in Article 41 of the Convention from the latter Court. This would defeat the purpose of the remedy provided for in Italian law by Law no. 89/2001 and entail a violation of the principle of the subsidiarity of the intervention of the .\n\nIt is therefore necessary to concur with the European Court of Human Rights, which, in the above-mentioned decision on the Scordino application (concerning the inadequacy of the protection afforded by the Italian courts in implementing Law no. 89/2001), affirmed that ‘it follows from the principle of subsidiarity ... that the national courts must, where possible, interpret and apply domestic law in accordance with the Convention’.\n\n... The preparatory documents of Law no. 89/2001 are even more explicit. In the report concerning the bill of Senator Pinto (proceedings of the Senate no. 3813 of 16 February 1999) it is affirmed that the compensatory mechanism proposed in the legislative initiative (and then adopted by the Act) secures for the applicant ‘a protection analogous to that which he or she would receive in the international court’, as the direct reference to Article 6 of the Convention makes it possible to transfer to domestic level ‘the limits of applicability of the same provision existing at international level, limits which depend essentially on the State and on the development of the case-law of the Strasbourg authorities, especially that of the European Court of Human Rights, whose decisions must therefore guide ... the domestic court in the definition of these limits’.\n\n...\n\n6.  The considerations expounded in sections 3 to 5 of the document refer in general to the importance of the interpretative guidance of the  on the implementation of Law no. 89/2001 with regard to reparation for non-pecuniary damage.\n\nIn this particular instance, however, any possibility for the national court to exclude non-pecuniary damage (despite having found a violation of Article 6 of the Convention) must be considered as non-existent because such is precluded by the previous decision of the European Court which, with reference to the same proceedings, had already ascertained that the unjustified delay in reaching a decision had had consequences involving non-pecuniary damage for the applicant, which the Court itself redressed for a limited period. From such a decision of the  it follows that, once the national court has ascertained that the violation has continued in the period following that considered in the said decision, the applicant has continued to suffer non-pecuniary damage, which must be compensated for in application of Law no. 89/2001.\n\nIt cannot therefore be maintained – as the Rome Court of Appeal has done – that compensation is not due because of the small amounts at stake in the proceedings in question. Such reasoning, apart from being rendered immaterial by the fact that the European Court has already ruled that non-pecuniary damage had been sustained because of a delay in the same action, is in any case incorrect, because the amount of what is at stake in an action in which non-compliance with reasonable time-limits has been ascertained can never have the effect of excluding non-pecuniary damage, given that the anxiety and distress resulting from the length of the proceedings normally also occur in cases in which the amounts at stake are small; hence this aspect may have the effect of reducing the amount of compensation but not of totally excluding it.\n\n7.  In conclusion the decision appealed against must be quashed and the case remitted to the Rome Court of Appeal, which, in a different composition, will order payment to the applicant of compensation for non-pecuniary damage payable as a result of the violation of the reasonable-time requirement for the period following 16 April 1996 alone, taking as a reference point payments of the same kind of damages by the European Court of Human Rights, from which it may diverge, but only to a reasonable extent (Court HR, 27 March 2003, Scordino v. Italy).”\n\n(b)  Case-law on the transfer of the right to compensation\n\n(i)  Judgment no. 17650/02 of the Court of Cassation, deposited with the registry on 15 October 2002\n\n65.  The Court of Cassation held as follows:\n\n“...Where the victim of unreasonably lengthy proceedings dies prior to the entry into force of Law no. 89/2001 [the ‘Pinto Act’] this shall preclude a right [to just satisfaction] from arising and passing to the heirs, in accordance with the general rule that a person who has died cannot become entitled to a right conferred by an Act that is passed after their death ...”\n\n(ii)  Judgment no. 5264/03 of the Court of Cassation, deposited with the registry on \n\n66.  The Court of Cassation judges noted that the right to compensation for a violation of the right to a hearing within a reasonable time derived from the Pinto Act. The mechanism put in place by the European standard did not give applicants a cause of action before the domestic courts. Accordingly, the right to “just satisfaction” could neither be acquired nor transferred by a person who had already died by the time the Pinto Act came into force. The fact that the deceased had, while alive, lodged an application with the  was not decisive. Section 6 of the Pinto Act did not constitute, as the applicants had maintained, a procedural standard bringing about a transfer of powers from the  to the domestic courts.\n\n(iii)  Order no. 11950/04 of the Court of Cassation, deposited with the registry on 26 June 2004\n\n67.  In this case, which concerned the possibility or otherwise of transferring to heirs the right to compensation deriving from a breach of Article 6 § 1 on account of the length of the proceedings, the First Division of the Court of Cassation referred the case to the full court indicating that there was a conflict between the case-law authorities, that is, between the restrictive approach taken by the Court of Cassation in the earlier judgments regarding heirs and the Pinto Act and the four judgments delivered by the Court of Cassation, sitting as a full court, on 26 January 2004 to the extent that a less strict interpretation would lead to the conclusion that this right to compensation has existed since Italy ratified the European Convention on 4 August 1955.\n\n(iv)  Extracts from judgment no. 28507/05 of the plenary Court of Cassation, deposited with the registry on 23 December 2005\n\n68.  In the case giving rise to the order mentioned above referring the case to the full court (see paragraph 67), the Court of Cassation, sitting as a full court, established the following principles, thus preventing any further conflicting decisions being given by the courts:\n\n“(i)  Law no. 848 of 4 August 1955, which ratified the Convention and made it enforceable, introduced into the domestic legal order the fundamental rights, belonging to the category of rights conferred on the individual by public law, provided for in Section I of the Convention and which correspond to a large extent to those set forth in Article 2 of the Constitution. In that respect the Convention provisions are confirmatory and illustrative. ...\n\n(ii)  It is necessary to reiterate the principle that the act giving rise to the right to reparation conferred by domestic law corresponds to a breach of the provision in Article 6 of the Convention, which is immediately applicable in domestic law.\n\nThe distinction between the right to a hearing within a reasonable time, introduced by the European Convention on Human Rights (or even pre-existing as a constitutionally protected value), and the right to equitable reparation, which was allegedly introduced only by the Pinto Act, cannot be allowed in so far as the protection provided by the domestic courts does not depart from that previously offered by the Strasbourg Court, the domestic courts being bound to comply with the case-law of the European Court. ...\n\n(iii)  Accordingly, the right to equitable reparation for loss sustained as a result of the unreasonable length of proceedings prior to the entry into force of Law no. 89/2001 must be acknowledged by the domestic courts even in favour of the heirs of a party who introduced the proceedings before that date, subject only to the condition that the claim has not already been lodged with the Strasbourg Court and the Court has not ruled on admissibility. ...”\n\n(c)  Judgment no. 18239/04 of the Court of Cassation, deposited with the registry on 10 September 2004, concerning the right to compensation of legal entities\n\n69.  This judgment of the Court of Cassation concerned an appeal by the Ministry of Justice challenging a court of appeal’s award of compensation for non-pecuniary damage to a juristic person. The Court of Cassation referred to the decision reached in Comingersoll S.A. v. Portugal ([GC], no. 35382/97, ECHR 2000-IV) and, after referring to the four judgments of the full court delivered on 26 January 2004, found that its own case-law was not in line with the European Court. It held that there was no legal barrier to awarding just satisfaction to “juristic” persons according to the criteria of the . Accordingly, since the court of appeal had correctly decided the case, the appeal was dismissed.\n\n(d)  Judgment no. 8568/05 of the Court of Cassation, deposited with the registry on 23 April 2005, concerning the presumption of non-pecuniary damage\n\n70.  The Court of Cassation made the following observations:\n\n“... [Considering that] non-pecuniary damage is the normal, albeit not automatic, consequence of a breach of the right to a hearing within a reasonable time, it will be deemed to exist, without it being necessary to specifically prove it (directly or by presumption), on the basis of the objective fact of the breach, on condition that there are no special circumstances indicating the absence of any such damage in the actual case concerned (Cass. A.P., 26 January 2004, nos. 1338 and 1339);\n\n–  the assessment on an equitable basis of compensation for non-pecuniary damage is subject – on account of the specific reference in section 2 of Law no. 89 of 24 March 2001 to Article 6 of the European Convention on Human Rights (ratified by Law no. 848 of 4 August 1955) – to compliance with the Convention, in accordance with the judicial interpretation given by the Strasbourg Court (non-compliance with which results in a violation of the law), and must therefore, as far as possible, be commensurate, in substantive and not merely formal terms, with the amounts paid in similar cases by the European Court, it being possible to adduce exceptional circumstances that suggest themselves in the particular case, on condition that they are reasoned, not excessive and not unreasonable (Cass. A.P., 26 January 2004, no. 1340);\n\n...\n\n–  a discrepancy in the method of calculation [between the Court’s case-law and section 2 of the Pinto Act] shall not affect the general vocation of Law no. 89/2001 to meet the objective of awarding proper compensation for a breach of the right to a hearing within a reasonable time (vocation acknowledged by the European Court in, inter alia, a decision of 27 March  Scordino v. Italy (application no. 36813/97)), and accordingly shall not allow any doubt as to the compatibility of that domestic standard with the international commitments entered into by the Italian Republic when ratifying the European Convention and the formal recognition, also at constitutional level, of the principle of Article 6 § 1 of that Convention ...”\n\nIII.  OTHER RELEVANT PROVISIONS\n\nA.  Third annual report on the excessive length of judicial proceedings in  for 2003 (administrative, civil and criminal justice)\n\n71.  In the report CM/Inf/DH(2004)23, revised on 24 September 2004, the Ministers’ Deputies made the following indications regarding an assessment of the Pinto remedy:\n\n“11.  As regards the domestic remedy introduced in 200 by the ‘Pinto Act’, a number of shortcomings remain, particularly in connection with the effectiveness of the remedy and its application in conformity with the Convention: in particular, the law does not provide yet for the acceleration of pending proceedings.\n\n...\n\n109.  In the framework of its examination of the 1st annual report, the Committee of Ministers expressed concern at the fact that this legislation did not foresee the speeding up of the proceedings and that its application posed a risk of aggravating the backlog of the appeal courts.\n\n...\n\n112.  It should be pointed out that in the framework of its examination of the 2nd annual report, the Committee of Ministers had noted with concern that the Convention had no direct effect and had consequently invited the Italian authorities to intensify their efforts at national level as well as their contacts with the different bodies of the Council of Europe competent in this field.\n\n...”\n\nB.  Interim Resolution ResDH(2005)114 concerning the judgments of the European Court of Human Rights and decisions by the Committee of Ministers in 2,183 cases against Italy relating to the excessive length of judicial proceedings\n\n72.  In this interim resolution the Ministers’ Deputies indicated as follows:\n\n“The Committee of Ministers ...\n\nNoting ...\n\n...\n\n–  the setting-up of a domestic remedy providing compensation in cases of excessive length of proceedings, adopted in 2001 (the ‘Pinto’ law), as well as the recent development of the case-law of the Court of Cassation, increasing the direct effect of the case-law of the European Court in the Italian legal system, while noting that this remedy still does not enable for acceleration of proceedings so as to grant effective redress to all victims;\n\nStressing that the setting-up of domestic remedies does not dispense States from their general obligation to solve the structural problems underlying violations;\n\nFinding that despite the efforts undertaken, numerous elements still indicate that the solution to the problem will not be found in the near future (as evidenced in particular by the statistical data, the new cases before both domestic courts and the European Court, the information contained in the annual reports submitted by the government to the Committee and in the reports of the Prosecutor General at the Court of Cassation);\n\n...\n\nStressing the importance the Convention attaches to the right to fair administration of justice in a democratic society and recalling that the problem of the excessive length of judicial proceedings, by reason of its persistence and extent, constitutes a real danger for the respect of the rule of law in Italy;\n\n...\n\nURGES the Italian authorities to enhance their political commitment and make it their effective priority to meet Italy’s obligation under the Convention and the Court’s judgments, to secure the right to a fair trial within a reasonable time to all persons under Italy’s jurisdiction;\n\n...”\n\nC.  The European Commission for the Efficiency of Justice ()\n\n73.  The European Commission for the Efficiency of Justice was set up at the Council of Europe by Resolution Res(2002)12 with the aim of (a) improving the efficiency and the functioning of the justice of member States with a view to ensuring that everyone within their jurisdiction can enforce their legal rights effectively, thereby generating increased confidence of the citizens in the justice system and (b) enabling a better implementation of the international legal instruments of the Council of Europe concerning efficiency and fairness of justice.\n\n74.  In its framework programme (CEPEJ (2004) 19 Rev 2 § 6), the CEPEJ noted that the mechanisms which are limited to compensation are too weak and do not adequately incite the States to modify their operational process, and provide compensation only a posteriori in the event of a proven violation instead of trying to find a solution for the problem of delays.\n\nTHE LAW\n\n  ALLEGED VIOLATIONS OF ARTICLE 1 OF PROTOCOL No. 1\n\n75.  The applicants complained of a double violation of Article 1 of Protocol No. 1, which provides:\n\n“Every natural or legal person is entitled to the peaceful enjoyment of his possessions. No one shall be deprived of his possessions except in the public interest and subject to the conditions provided for by law and by the general principles of international law.\n\nThe preceding provisions shall not, however, in any way impair the right of a State to enforce such laws as it deems necessary to control the use of property in accordance with the general interest or to secure the payment of taxes or other contributions or penalties.”\n\n76.  The applicants alleged that they had borne a disproportionate burden on account of the inadequate amount of the expropriation compensation, which had been calculated in accordance with the criteria laid down in section 5 bis of Law no. 359/1992.\n\n77.  They also complained of the retrospective application of section 5 bis of Law no. 359/1992.\n\nA.  The amount of compensation awarded to the applicants\n\n1.  Whether there was an interference with the right of property\n\n78.  As the Court has reiterated on a number of occasions, Article 1 of Protocol No. 1 contains three distinct rules: “the first rule, set out in the first sentence of the first paragraph, is of a general nature and enunciates the principle of the peaceful enjoyment of property; the second rule, contained in the second sentence of the first paragraph, covers deprivation of possessions and subjects it to certain conditions; the third rule, stated in the second paragraph, recognises that the Contracting States are entitled, amongst other things, to control the use of property in accordance with the general interest ... . These rules are not ‘distinct’ in the sense of being unconnected: the second and third rules, which are concerned with particular instances of interference with the right to the peaceful enjoyment of property, are to be construed in the light of the principle laid down in the first rule” (see, among other authorities, James and Others v. the United Kingdom, 21 February 1986, § 37, Series A no. 98, which partly reiterates the terms of the Court’s reasoning in Sporrong and Lönnroth v. Sweden, 23 September 1982, § 61, Series A no. 52; see also The Holy Monasteries v. Greece, 9 December 1994, § 56, Series A no. 301-A; Iatridis v. Greece [GC], no. 31107/96, § 55, ECHR 1999-II; and Beyeler v. Italy [GC], no. 33202/96, § 106, ECHR 2000-I).\n\n79.  The Grand Chamber notes that the Government did not dispute the findings of the Chamber, which had considered that in the instant case there had been a deprivation of property within the meaning of the second sentence of Article 1 of Protocol No. 1 (see paragraph 84 of the Chamber judgment).\n\n80.  The Grand Chamber agrees with the Chamber’s analysis on this point. It must therefore now determine whether the interference complained of is justified under that provision.\n\n2.  Justification for the interference with the right of property\n\n(a)  “Provided for by law” and “in the public interest”\n\n81.  It is not disputed that the applicants were deprived of their property in accordance with the law and that the expropriation pursued a legitimate aim in the public interest.\n\n(b)  Proportionality of the interference\n\n(i)  The Chamber judgment\n\n82.  In its judgment of 29 July 2004 (see paragraphs 98-103 of the Chamber judgment), the Chamber arrived at the following conclusions:\n\n“The Court notes that the applicants received the highest amount of compensation available under section 5 bis of Law no. 359/1992. The further 40% deduction was indeed not applied in this case ...\n\nThe Court also notes that the final amount of compensation was fixed at ITL 82,890 per square metre, whereas the estimated market value of the land was ITL 165,755 per square metre ...\n\nIn addition, that amount was subsequently taxed at a rate of 20% ...\n\nLastly, the Court does not overlook the amount of time that elapsed between the expropriation and the final assessment of the compensation ...\n\nHaving regard to the margin of appreciation Article 1 of Protocol No. 1 affords national authorities, the Court considers that the price paid to the applicants did not bear a reasonable relation to the value of the expropriated property (see Papachelas v. Greece [GC], no. 31423/96, § 49, ECHR 1999-II, and Platakou v. Greece, no. 38460/97, § 54, ECHR 2001-I). It follows that the fair balance was upset.\n\nAccordingly, there has been a violation of Article 1 of Protocol No. 1.”\n\n(ii)  Submissions of those appearing before the Court\n\n(α)  The applicants\n\n83.  The applicants asked the Grand Chamber to endorse the Chamber judgment and argued that the compensation received did not bear a reasonable relation to the value of the property. They observed that the expropriation compensation awarded them by the domestic courts corresponded to half the market value of the land. That amount had subsequently been reduced by a further 20% once tax had been deducted at source pursuant to Law no. 413/1991.\n\n84.  The applicants went on to observe that the compensation for the expropriation had been calculated in accordance with the criteria laid down in section 5 bis of Law no. 359/1992. That provision provided for the same level of compensation for all land regardless of the works in the public interest for which the land had been earmarked, the objectives pursued and the circumstances of the expropriation.\n\n85.  The applicants also asserted that their land had been expropriated in order to allow a cooperative society to build accommodation there for private individuals, who, in accordance with domestic law (section 20 of Law no. 179/1992), would be free to sell their homes at market value five years later. The expropriation of the applicants’ land had therefore benefited private individuals.\n\n86.  Lastly, the applicants pointed out that the  had held that the compensation criteria in question, having regard to their temporary nature, were compatible with the Constitution. Section 5 bis of Law no. 359/1992 remained in force until  and was incorporated into the Code of Expropriation Laws, which came into force on that date.\n\n(β)  The Government\n\n87.  The Government contested the Chamber’s conclusion on this point.\n\n88.  They observed that, in calculating compensation for expropriation, a balance had to be struck between private interests and the general interest. Accordingly, adequate compensation could be lower than the market value of the land in question, as, indeed, the  had acknowledged (judgments no. 283 of , no. 80 of  and no. 148 of ).\n\n89.  Relying on the Court’s judgments in The Holy Monasteries (cited above), Papachelas v. Greece [GC], no. 31423/96, ECHR 1999-II, Lithgow and Others v. the United Kingdom, 8 July 1986, Series A no. 102, and James and Others (cited above), the Government submitted that the application in question should be examined in the light of the principle that the Convention did not require compensation at the full market value of the property and that compensation in an amount reasonably related to the value of the property sufficed not to upset the necessary fair balance.\n\nHaving regard to the margin of appreciation left to the States, it was difficult to entrust to the Court the task of assessing the reasonableness of the compensation for expropriation because the Court was “too far removed from the economic and social reality of the country concerned and, accordingly, could not avoid the risk of arbitrariness”.\n\n90.  Whilst accepting that the amount awarded to the applicants was far less than the value of the land, the Government submitted that it was not derisory and that the gap between the market value and the compensation paid was reasonable and justified.\n\nThey pointed out in that connection that reimbursement of less than the full market value as provided for in section 5 bis of Law no. 359/1992 reflected a “community spirit” and the “current political desire” to establish a system going beyond traditional nineteenth-century liberalism.\n\nThey went on to observe that the “market value” of property was a vague and uncertain concept, which depended on a great many variables and was essentially subjective: it could for example be influenced by the financial circumstances of the vendor or a particularly strong interest on the part of the purchaser. Furthermore, given that land was generally valued on the basis of a comparative survey of property transactions during a given period in respect of land of a similar type, such a survey would not convey the subjective elements of the various transactions.\n\n91.  The Government contended that in any event the market value of land was one of the factors taken into account in the calculation done by the domestic courts in accordance with section 5 bis of Law no. 359/1992. Under that provision, the market value was adjusted by another criterion, namely, the ground rent calculated on the value entered in the land register.\n\n92.  The Government concluded by asking the Grand Chamber to declare that the system applied in the instant case for calculating the compensation payable for the expropriation was not unreasonable and had not upset the necessary fair balance.\n\n(iii)  The Court’s assessment\n\n(α)  Recapitulation of the relevant principles\n\n93.  An interference with the right to the peaceful enjoyment of possessions must strike a “fair balance” between the demands of the general interest of the community and the requirements of the protection of the individual’s fundamental rights (see, among other authorities, Sporrong and Lönnroth, cited above, § 69). The concern to achieve this balance is reflected in the structure of Article 1 of Protocol No. 1 as a whole, including therefore the second sentence, which is to be read in the light of the general principle enunciated in the first sentence. In particular, there must be a reasonable relationship of proportionality between the means employed and the aim sought to be realised by any measure applied by the State, including measures depriving a person of his possessions (see os Compania Naviera S.A. and Others v. Belgium, 20 November 1995, § 38, Series A no. 332; The former King of Greece and Others v. Greece [GC], no. 25701/94, §§ 89-90, ECHR 2000-XII; and Sporrong and Lönnroth, cited above, § 73).\n\n94.  In determining whether this requirement is met, the Court recognises that the State enjoys a wide margin of appreciation with regard both to choosing the means of enforcement and to ascertaining whether the consequences of enforcement are justified in the general interest for the purpose of achieving the object of the law in question (see Chassagnou and Others v. France [GC], nos. 25088/94, 28331/95 and 28443/95, § 75, ECHR 1999-III). Nevertheless, the Court cannot abdicate its power of review and must determine whether the requisite balance was maintained in a manner consonant with the applicants’ right to the peaceful enjoyment of their possessions, within the meaning of the first sentence of Article 1 of Protocol No. 1 (see Jahn and Others v. Germany [GC], nos. 46720/99, 72203/01 and 72552/01, § 93, ECHR 2005-VI).\n\n95.  Compensation terms under the relevant legislation are material to the assessment of whether the contested measure respects the requisite fair balance and, notably, whether it does not impose a disproportionate burden on the applicants. In this connection the Court has already found that the taking of property without payment of an amount reasonably related to its value will normally constitute a disproportionate interference and a total lack of compensation can be considered justifiable under Article 1 of Protocol No. 1 only in exceptional circumstances (see The Holy Monasteries, cited above, § 71, and The former King of Greece and Others, cited above, § 89). Article 1 of Protocol No. 1 does not, however, guarantee a right to full compensation in all circumstances (see James and Others, cited above, § 54, and Broniowski v. Poland [GC], no. 31443/96, § 182, ECHR 2004-V).\n\n96.  While it is true that in many cases of lawful expropriation, such as the distinct expropriation of land with a view to building a road or for other purposes “in the public interest”, only full compensation can be regarded as reasonably related to the value of the property, that rule is not without its exceptions (see The former King of Greece and Others v. Greece (just satisfaction) [GC], no. 25701/94, § 78, 28 November 2002).\n\n97.  Legitimate objectives in the “public interest”, such as those pursued in measures of economic reform or measures designed to achieve greater social justice, may call for less than reimbursement of the full market value (see James and Others, cited above, § 54). The Court considers it useful to give a brief outline of its case-law on this point.\n\n98.  In James and Others, the issue was whether, in the context of leasehold-reform legislation, the conditions empowering long-term leasehold tenants to acquire their property struck a fair balance. The Court found that they did, holding that the context was one of social and economic reform in which the burden borne by the freeholders was not unreasonable, even though the amounts received by the interested parties were less than the full market value of the property.\n\nIn Lithgow and Others (cited above) the Court examined an issue relating to the nationalisation of companies engaged in the aircraft and shipbuilding industries, as part of the economic, social and political programme run by the party that had won the elections, which was intended to provide a sounder organisational and economic footing and bring to the authorities a desirably greater degree of public control and accountability. The Court held that, in this context, the arrangements for compensating the shareholders concerned were fair and not unreasonable as compared with the full value of the shares.\n\nThe Court has held that less than full compensation may also be necessary a fortiori where property is taken for the purposes of “such fundamental changes of a country’s constitutional system as the transition from monarchy to republic” (see The former King of Greece, cited above, § 87). The State has a wide margin of appreciation when enacting laws in the context of a change of political and economic regime (see, in particular, Kopecký v. Slovakia [GC], no. 44912/98, § 35, ECHR 2004-IX). The Court has reaffirmed this principle in Broniowski (cited above, § 182), in the context of the country’s transition towards a democratic regime, and has specified that rules regulating ownership relations within the country “involving a wide-reaching but controversial legislative scheme with significant economic impact for the country as a whole” could involve decisions restricting compensation for the taking or restitution of property to a level below its market value. The Court has also reiterated these principles regarding the enactment of laws in “the exceptional context of German reunification” (see Von Maltzan and Others v.  (dec.) [GC], nos. 71916/01, 71917/01 and 10260/02, §§ 77 and 111-12, ECHR 2005-V, and Jahn and Others, cited above).\n\nLastly, in Papachelas (cited above), the issue concerned the expropriation of more than 150 properties, including part of the applicants’ property, for the purposes of building a major road. The Court held that the compensation awarded to the applicants had not upset the fair balance between the opposing interests, since it was only 1,621 Greek drachmas per square metre less than the value of the land as estimated by the Association of Sworn Valuers.\n\n(β)  Application of the foregoing principles to the present case\n\n99.  In the instant case, having regard to the fact that it has already been established that the interference in question satisfied the requirement of lawfulness and was not arbitrary, less than full compensation does not make the taking of the applicants’ property eo ipso wrongful (see, mutatis mutandis, The former King of Greece and Others (just satisfaction), cited above, § 78). Accordingly, it remains to be determined whether, in the context of a lawful deprivation of property, the applicants had to bear a disproportionate and excessive burden.\n\n100.  The Court observes that the compensation awarded to the applicants was calculated on the basis of the criteria laid down in section 5 bis of Law no. 359/1992. It notes that these criteria apply irrespective of the works in the public interest for which the land has been earmarked and the context of the expropriation. It reiterates that its task is not to review the relevant legislation in the abstract; it has to confine itself, as far as possible, to examining the problems raised by the specific case before it. To that end, in the instant case, it must examine the above-mentioned law in so far as the applicants objected to its consequences for their property (see The Holy Monasteries, cited above, § 55).\n\n101.  In the instant case the final amount of the compensation was fixed at ITL 82,890 per square metre, whereas the estimated market value of the land at the date of the expropriation was ITL 165,755 per square metre (see paragraphs 32 and 37 above). Consequently, the compensation for expropriation is far lower than the market value of the property in question. Furthermore, tax was subsequently deducted from it at a rate of 20% (see paragraph 41 above).\n\n102.  The present case concerns a distinct expropriation, and one which was neither carried out as part of a process of economic, social or political reform nor linked to any other specific circumstances. Accordingly, in this case, the Court does not discern any legitimate objective “in the public interest” capable of justifying less than reimbursement of the market value.\n\n103.  Having regard to all the foregoing considerations, the Court considers that the compensation awarded to the applicants was inadequate, given the low amount awarded and the lack of public-interest grounds capable of justifying less than compensation at the market value of the property. Accordingly, the applicants have had to bear a disproportionate and excessive burden which cannot be justified by a legitimate aim in the public interest pursued by the authorities.\n\n104.  Consequently, there has been a violation of Article 1 of Protocol No. 1.\n\nB.  The “retrospective” application of section 5 bis of Law no. 359/1992\n\n105.  The applicants alleged that section 5 bis of Law no. 359/1992 had infringed their right to the peaceful enjoyment of their possessions, in breach of Article 1 of Protocol No. 1.\n\n1.  The Chamber judgment\n\n106.  The Chamber considered that the issue raised by the applicants relating to interference by the legislature fell under Article 6 of the Convention and considered it unnecessary to examine separately whether there had also been a breach of Article 1 of Protocol No. 1.\n\n2.  Submissions of those appearing before the Court\n\n(a)  The applicants\n\n107.  The applicants reiterated that, prior to the entry into force of section 5 bis of Law no. 359/1992, their land had already been expropriated and they had brought legal proceedings seeking compensation to which they could legitimately expect to be entitled under Law no. 2359/1865. As the law in question was applicable to expropriations that were under way and to the related proceedings, including the ones concerning them, it had had the effect of depriving them of a substantial part of the compensation to which they were entitled. The enactment of that law therefore amounted to an interference with the applicants’ right to the peaceful enjoyment of their possessions that was incompatible with Article 1 of Protocol No. 1.\n\n(b)  The Government\n\n108.  The Government denied that the new law had been of retrospective application. In any event, they submitted that the Convention did not prohibit the retrospective application of laws and that, even assuming that there had been interference by the legislature, that interference therefore fell within the margin of appreciation left to the States and was justified. With regard to a fair balance, they pointed out that the applicants’ right to compensation had not been called into question, and that the provision in question had been limited to restricting the amount of compensation payable.\n\n3.  The Court’s assessment\n\n109.  In relation to their complaint of the retrospective application to their case of Law no. 359/1992, the applicants alleged that they had been deprived of the right to compensation provided for in the legislation previously applicable to cases of expropriation of land.\n\nThe Court considers that the applicants’ complaint in this regard is subsumed by the one raised regarding the inadequacy of the expropriation compensation (see paragraphs 78-104 above) and the one they raised regarding interference by the legislature in the judicial process (see paragraphs 111-33 below).\n\n110.  Accordingly, having regard to the conclusions set out in paragraphs 104 and 133, the Court does not consider it necessary to examine separately under Article 1 of Protocol No. 1 the complaint based on interference by the legislature.\n\nII.  ALLEGED VIOLATION OF ARTICLE 6 § 1 OF THE CONVENTION ON ACCOUNT OF THE UNFAIRNESS OF THE PROCEEDINGS\n\n111.  The applicants alleged that the enactment and application to their case of section 5 bis of Law no. 359/1992 amounted to interference by the legislature in breach of their right to a fair hearing as guaranteed by Article 6 § 1 of the Convention, the relevant parts of which provide:\n\n“In the determination of his civil rights and obligations ..., everyone is entitled to a fair ... hearing within a reasonable time by [a] ... tribunal ...”\n\n1.  The Chamber judgment\n\n112.  The Chamber held that the proceedings instituted by the applicants seeking compensation for the expropriation had been unfair because the domestic courts had based themselves on the impugned provision when deciding the matter of compensation for expropriation which had been referred to them. It held that this had amounted to interference by the legislature in the judicial process with a view to influencing the determination of the dispute.\n\n2.  Submissions of those appearing before the Court\n\n(a)  The applicants\n\n113.  The applicants complained of an interference by the legislature in the judicial process on account of the enactment and application to their case of section 5 bis of Law no. 359/1992. They complained, among other things, that they had not had a fair hearing because, when the amount of their expropriation compensation was determined, the question submitted to the national courts had been settled by the legislature and not by the judiciary.\n\n114.  In that connection the applicants pointed out that the provision in question had introduced criteria for calculating expropriation compensation which reduced by at least 50% the amount to which they had been entitled under the law in force when the compensation proceedings were instituted in the Reggio di Calabria Court of Appeal and the land was expropriated.\n\n115.  Regarding the law applicable prior to the entry into force of the impugned provision, the applicants pointed out that Laws nos. 865/1971 and 385/1980 had been declared unconstitutional and, accordingly, had been repealed with retrospective effect. They could not therefore be regarded as applicable to the case in question. The only provision applicable prior to the entry into force of section 5 bis was section 39 of the Law of 1865, which guaranteed the applicants full compensation (see paragraphs 47-56 above).\n\n116.  The applicants pointed out that the impugned provision had been inspired merely by financial considerations, which could not be regarded as serving a vital public interest justifying retrospective application, and had been enacted with the sole purpose of settling pending proceedings in a manner advantageous to the respondent authorities.\n\n117.  The applicants then observed that section 5 bis had been declared constitutional by the  because it was a temporary measure designed to deal with a specific situation. However, the provision had been in force until  and had now been incorporated into the Code of Expropriation Laws, which had been in force since that date.\n\n(b)  The Government\n\n118.  In their letter requesting that the case be referred to the Grand Chamber and in their written and oral observations to the Grand Chamber, the Government strongly disputed the Chamber judgment on this issue.\n\n119.  As a preliminary point, they denied that the new law had been of retrospective application since it was limited, after modifying the existing legal position, to making it immediately applicable to pending cases in accordance with a commonly applied principle. In any event, the Government submitted that the Convention did not prohibit the retrospective application of laws and therefore, assuming that there had been interference by the legislature, that interference fell within the margin of appreciation left to the States and was justified.\n\n120.  The Government then observed that at the time of occupation of the land and the expropriation order (in March 1981 and March 1983 respectively) the criteria introduced by Law no. 865/1971 and incorporated into Law no. 385/1980 were still in force, since the decision declaring the law unconstitutional was not made until 15 July 1983.\n\nThe compensation criteria declared unconstitutional were less favourable to the applicants than those introduced by section 5 bis of Law no. 359/1992. Had the context been one of succeeding laws, with the preceding law being repealed by the more recent one, it would be the provisions declared unconstitutional that applied in the present case, given that the right to compensation arose at the time of the expropriation. In that event it could therefore be argued that, in the absence of a legislative amendment to the detriment of the expropriated party, that is, in the absence of adverse effects deriving from section 5 bis of Law no. 359/1992, the new law did not amount to an interference with the applicants’ rights.\n\n121.  However, the Government accepted that the present case did not concern legislation that had been introduced to repeal the preceding legislation or laws succeeding each other in time. They reiterated in that connection that the judgments of the  were of “retrospective” scope: laws declared unconstitutional became ineffective and the laws previously in force were “revived” (see paragraphs 47-56 above). They thus acknowledged that the judgments of the  had had the effect of annulling the two laws in question from the outset, and this had “revived” the provision of the general expropriation law of 1865, which had immediately come back into force. The Government observed that the domestic courts could accordingly reapply the compensation criteria laid down in the Law of 1865.\n\n122.  Nevertheless, the Government argued that the law of which the applicants complained was part of a political process that had started in 1971 and sought to depart from the general expropriation law of 1865 in order to go beyond the outdated principles of a liberal economy. From that standpoint, the declarations of unconstitutionality had created a “vacuum”, since the fact that the Law of 1865 had come back into force did not correspond to the political, economic and social demands guiding the legislature. From that point of view, section 5 bis of Law no. 359/1992 had therefore remedied a loophole.\n\n123.  The Government observed that section 5 bis of Law no. 359/1992 had almost certainly been inspired by budgetary considerations and answered the need to control public finances. The Court could not criticise such considerations.\n\n124.  Lastly, the Government contended that section 5 bis of Law no. 359/1992 had not been enacted in order to influence the determination of the proceedings instituted by the applicants.\n\n125.  They concluded that the application of the impugned provision to the applicants’ case did not raise an issue under the Convention. In support of their submissions, the Government referred specifically to the judgments in Forrer-Niedenthal v. Germany (no. 47316/99, 20 February 2003), OGIS-Institut Stanislas and Others v. France (nos. 42219/98 and 54563/00, 27 May 2004) and Bäck v. Finland (no. 37598/97, ECHR 2004-VIII).\n\n3.  The Court’s assessment\n\n126.  The Court reiterates that, although, in theory, the legislature is not precluded in civil matters from adopting new retrospective provisions to regulate rights arising under existing law, the principle of the rule of law and the notion of fair trial enshrined in Article 6 of the Convention preclude any interference by the legislature – other than on compelling grounds of the general interest – with the administration of justice designed to influence the judicial determination of a dispute (see Zielinski and Pradal and Gonzalez and Others v. France [GC], nos. 24846/94 and 34165/96 to 34173/96, § 57, ECHR 1999-VII; Stran Greek Refineries and Stratis Andreadis v. Greece, 9 December 1994, Series A no. 301-B; and Papageorgiou v. Greece, 22 October 1997, Reports of Judgments and Decisions 1997-VI).\n\n127.  The Court points out that, prior to the entry into force of section 5 bis of Law no. 359/1992 and having regard to the two rulings of the Italian Constitutional Court of 25 January 1980 and 15 July 1983, the law applicable to the present case was Law no. 2359/1865 (see paragraphs 47-56 above), section 39 of which provided for a right to compensation at the full market value of the property. As a result of the impugned provision, the compensation payable to the applicants was substantially reduced.\n\n128.  By modifying the law applicable to awards of compensation in respect of expropriations that were under way, and to the related pending judicial proceedings other than those on which a final ruling regarding the principle of compensation had been given, section 5 bis of Law no. 359/1992 applied new compensation rules to situations that had arisen before it came into force and had already given rise to claims to compensation – and even to proceedings pending on that date – thereby producing a retrospective effect.\n\n129.  As a result of the application of this provision, owners of expropriated land were deprived of a substantial part of the compensation they could previously have claimed under Law no. 2359/1865.\n\n130.  Accordingly, even though the proceedings were not annulled under section 5 bis of Law no. 359/1992, the provision in question, which was applicable to the judicial proceedings that the applicants had instituted and which were pending, had the effect of definitively modifying the outcome by defining retrospectively the terms of the debate to their detriment. Although the Government submitted that the legislative provision was not aimed specifically at the present dispute, or any other dispute in particular, the Court considers that, as it was immediately applicable, it had the effect of frustrating proceedings then in progress of the type brought by the applicants. The manifest object, and the effect, of the impugned provision was in any event to modify the applicable rules relating to compensation, including in the case of judicial proceedings then in progress to which the State was a party (see Anagnostopoulos and Others v. Greece, no. 39374/98, §§ 20-21, ECHR 2000-XI).\n\n131.  Admittedly, the applicability to current awards of compensation and to pending proceedings cannot in itself give rise to a problem under the Convention since the legislature is not, in theory, prevented from intervening in civil cases to amend the existing legal position by means of an immediately applicable law (see OGIS-Institut Stanislas and Others, cited above, § 61, and Zielinski and Pradal and Gonzalez and Others, cited above, § 57).\n\nHowever, in the present case section 5 bis of Law no. 359/1992 simply extinguished, with retrospective effect, an essential part of claims for compensation, in very high sums, that owners of expropriated land, such as the applicants, could have claimed from the expropriating authorities. In that connection the Court reiterates its finding that the compensation awarded to the applicants was inadequate, given the low amount in question and the lack of public-interest grounds justifying less than compensation at the market value of the property (see paragraphs 103-04 above).\n\n132.  In the Court’s view, the Government have not demonstrated that the considerations to which they referred, namely, budgetary considerations and the legislature’s intention to implement a political programme, amounted to an “obvious and compelling general interest” required to justify the retrospective effect that it has acknowledged in certain cases (see National & Provincial Building Society, Leeds Permanent Building Society and Yorkshire Building Society v. the United Kingdom, 23 October 1997, Reports 1997-VII; OGIS-Institut Stanislas and Others, cited above, § 61; Forrer-Niedenthal, cited above; and Bäck, cited above).\n\n133.  There has therefore been a violation of Article 6 § 1 of the Convention.\n\nIII.  ALLEGED VIOLATION OF ARTICLE 6 § 1 OF THE CONVENTION ON ACCOUNT OF THE EXCESSIVE LENGTH OF THE PROCEEDINGS\n\n134.  The applicants submitted that the proceedings they had instituted seeking expropriation compensation had failed to comply with the “reasonable time” requirement set forth in Article 6 § 1 of the Convention, which provides:\n\n“In the determination of his civil rights and obligations ... ,everyone is entitled to a ... hearing within a reasonable time by [a] tribunal ...”\n\nA.  The Government’s preliminary objection of non-exhaustion of domestic remedies\n\n135.  As before the Chamber, the Government submitted that the applicants had not exhausted domestic remedies regarding the complaint about the excessive length of the proceedings.\n\n1.  The Chamber decision\n\n136.  In its admissibility decision of 27 March 2003 ((dec.), no. 36813/97, ECHR 2003-IV), the Chamber dismissed the Government’s objection for the following reasons:\n\n“The Court has carried out a comparative analysis of the one hundred Court of Cassation judgments available to date. It has noted that the principles set forth in the two cases cited by the applicants (see ‘Relevant domestic law and practice’ above) have been consistently applied: in other words, the right to a hearing within a reasonable time has not been regarded as a fundamental right and the Convention and the Strasbourg case-law are not directly applicable in relation to just satisfaction.\n\nThe Court has not found any instances in which the Court of Cassation has entertained a complaint to the effect that the amount awarded by the court of appeal was insufficient in relation to the alleged damage or inadequate in the light of the  institutions’ case-law. Such complaints have been dismissed by the Court of Cassation, being treated either as factual issues outside its jurisdiction or as issues arising on the basis of provisions that are not directly applicable.\n\n...\n\nHaving regard to the foregoing, the Court concludes that there would have been no point in the applicants’ appealing to the Court of Cassation as their complaint concerned the amount of compensation and thus fell within the categories referred to above. Furthermore, the applicants risked being ordered to pay costs.\n\nIn conclusion, the Court considers that in the instant case the applicants were not required to appeal to the Court of Cassation for the purpose of exhausting domestic remedies. Accordingly, the Government’s first objection must be dismissed.\n\nThat conclusion does not, however, call into question the obligation to lodge a claim for compensation under the Pinto Act with the court of appeal and the Court of Cassation, provided that it is clear from the case-law of the national courts that they apply the Act in keeping with the spirit of the Convention and, consequently, that the remedy is effective.”\n\n137.  In its judgment of 29 July 2004, the Chamber dismissed the objection that had again been raised by the Government, considering that the arguments they had advanced were not such as to call the admissibility decision into question (see paragraphs 59-62 of the Chamber judgment).\n\n2.  Submissions of those appearing before the Court\n\n(a)  The Government\n\n138.  The Government submitted that the applicants had not exhausted domestic remedies because they had not appealed to the Court of Cassation against the  Court of Appeal’s decision.\n\nIn their submission the Court had erred in the admissibility decision in holding that an appeal to the Court of Cassation was not a remedy that had to be exercised. The Court of Cassation could, they maintained, have examined the applicants’ complaint about the inadequacy of the compensation awarded by the Court of Appeal under the Pinto Act as compared with the amount that they could have obtained in accordance with the Court’s case-law on Article 41 of the Convention.\n\nIn support of that submission the Government referred to the four judgments, nos. 1338, 1339, 1340 and 1341, delivered by the Court of Cassation, sitting as a full court, on 26 January 2004 (see paragraphs 63-64 above).\n\n(b)  The applicants\n\n139.  The applicants challenged the Government’s objection and submitted that the Grand Chamber should confirm the admissibility decision of  and the judgment of  in which the Chamber had dismissed the objection.\n\nThey went on to observe that the departure from precedent by the Court of Cassation, on the basis of which the Government reiterated their objection, had not occurred until after the admissibility decision, and after the decision of the Court of Appeal in this case had become final.\n\n3.  The Court’s assessment\n\n140.  Under Article 1 of the Convention, which provides: “The High Contracting Parties shall secure to everyone within their jurisdiction the rights and freedoms defined in Section I of this Convention”, the primary responsibility for implementing and enforcing the rights and freedoms guaranteed by the Convention is laid on the national authorities. The machinery of complaint to the Court is thus subsidiary to national systems safeguarding human rights. This subsidiary character is articulated in Articles 13 and 35 § 1 of the Convention.\n\n141.  The purpose of Article 35 § 1, which sets out the rule on exhaustion of domestic remedies, is to afford the Contracting States the opportunity of preventing or putting right the violations alleged against them before those allegations are submitted to the Court (see, among other authorities, Selmouni v. France [GC], no. 25803/94, § 74, ECHR 1999-V). The rule in Article 35 § 1 is based on the assumption, reflected in Article 13 (with which it has a close affinity), that there is an effective domestic remedy available in respect of the alleged breach of an individual’s Convention rights (see Kudła v. Poland [GC], no. 30210/96, § 152, ECHR 2000-XI).\n\n142.  Nevertheless, the only remedies Article 35 of the Convention requires to be exhausted are those that relate to the breaches alleged and at the same time are available and sufficient. The existence of such remedies must be sufficiently certain not only in theory but also in practice, failing which they will lack the requisite accessibility and effectiveness (see, inter alia, Vernillo v. France, 20 February 1991, § 27, Series A no. 198; Dalia v. France, 19 February 1998, § 38, Reports 1998-I; and Mifsud v. France (dec.) [GC], no. 57220/00, ECHR 2002-VIII).\n\n143.  By enacting the Pinto Act,  introduced a purely compensatory remedy for cases in which there had been a breach of the reasonable-time requirement (see paragraph 62 above).\n\n144.  The Court has already held that the remedy before the courts of appeal introduced by the Pinto Act was accessible and that there was no reason to question its effectiveness (see Brusco v. Italy (dec.), no. 69789/01, ECHR 2001-IX). Moreover, having regard to the nature of the Pinto Act and the context in which it was passed, the Court went on to find that there were grounds for departing from the general principle that the exhaustion requirement should be assessed with reference to when the application was lodged. That was the case not only in respect of applications lodged after the date on which the Act came into force, but also of those which were already on the Court’s list of cases by that date. It had taken into consideration, among other things, the transitional provision provided for in section 6 of the Pinto Act (see paragraph 62 above), which afforded Italian litigants a genuine opportunity to obtain redress for their grievances at national level for all applications currently pending before the Court that had not yet been declared admissible (see Brusco, cited above).\n\n145.  In the instant case the Chamber held that where applicants complained only of the amount of compensation and the discrepancy between that amount and the amount which would have been awarded under Article 41 of the Convention they were not required – for the purpose of exhausting domestic remedies – to appeal to the Court of Cassation against the Court of Appeal’s decision. The Chamber based that conclusion on a study of some one hundred Court of Cassation judgments. In none of those judgments had that court entertained a complaint to the effect that the amount awarded by the Court of Appeal was insufficient in relation to the loss alleged or inadequate in the light of the  case-law (see the extract of the Scordino admissibility decision quoted in paragraph 136 above).\n\n146.  The Court notes that on  the Court of Cassation, sitting as a full court, quashed four decisions concerning cases in which the existence or amount of non-pecuniary damage had been disputed. In so doing, it established the principle that “the court of appeal’s determination of non-pecuniary damage in accordance with section 2 of Law no. 89/2001, although inherently based on equitable principles, must be done in a legally defined framework since reference has to be made to the amounts awarded, in similar cases, by the . Some divergence is permissible, within reason” (see paragraph 63 above).\n\n147.  The Court takes note of that departure from precedent and welcomes the Court of Cassation’s efforts to bring its decisions into line with European case-law. It reiterates, furthermore, having deemed it reasonable to assume that the departure from precedent, in particular judgment no. 1340 of the Court of Cassation, must have been public knowledge from 26 July 2004. It has therefore held that, from that date onwards, applicants should be required to avail themselves of that remedy for the purposes of Article 35 § 1 of the Convention (see Di Sante v. Italy (dec.), no. 56079/00, 24 June 2004, and, mutatis mutandis, Broca and Texier-Micault v. France, nos. 27928/02 and 31694/02, § 20, 21 October 2003).\n\n148.  In the instant case the Grand Chamber, like the Chamber, notes that the time-limit for appealing to the Court of Cassation had expired before 26 July 2004 and considers that, in these circumstances, the applicants were dispensed from the obligation to exhaust domestic remedies.\n\n149.  In the light of these considerations, the Court concludes that this objection must be dismissed.\n\nB.  The Government’s preliminary objection concerning the lack of “victim” status\n\n150.  As before the Chamber, the Government argued that, in awarding compensation to the applicants, the  Court of Appeal had not only acknowledged that there had been a violation of their right to a hearing within a reasonable time but had also made good the loss sustained. Consequently, the applicants had lost their “victim” status.\n\n1.  The Chamber decision\n\n151.  In its admissibility decision the Chamber stated that the applicants could still claim to be “victims” within the meaning of Article 34 of the Convention, even though the domestic courts had acknowledged that there had been a violation, as the compensation obtained at domestic level under the Pinto Act was not capable of making good the loss sustained.\n\n2.  Submissions of those appearing before the Court\n\n(a)  The Government\n\n152.  According to the Government, the applicants were no longer “victims” of the alleged violation because they had obtained from the Court of Appeal a decision finding that the “reasonable time” had been exceeded, as well as compensation.\n\n153.  Regarding the amount obtained under the Pinto Act, the sum could not be called into question by the Court because the domestic court had made its decision on an equitable basis and in accordance with the margin of appreciation available to it regarding just satisfaction. The assessment of the level of compensation thus fell outside the Court’s competence in accordance with the subsidiarity principle and the margin of appreciation left to the States.\n\nIn that connection the Government considered that the acknowledgment of the existence of damage and the determination of quantum were part of the assessment of evidence which fell within the jurisdiction of the domestic courts and was in theory outside the competence of the supranational court. Although the Court did admittedly have the power to review decisions submitted to it with a view to ensuring that the reasoning was neither manifestly unreasonable nor arbitrary and was consonant with logic and the lessons derived from experience actually encountered in the social context, it could not, however, impose its own criteria or substitute its own beliefs for those of the domestic courts in assessing the evidence.\n\n154.  Furthermore, the Government pointed out that the Court had to strike a fair balance between the requirement of clarity and respect for principles such as the States’ margin of appreciation and subsidiarity. The attempt to strike that balance had to be governed by the general rule that any factor to be taken into account which was stated loosely or vaguely in the Strasbourg case-law had to be considered with the greatest respect for the corresponding margin of appreciation to be enjoyed by each State without fear of being subsequently disavowed by the Court.\n\n155.  The Government then felt it important to explain the criteria used in Italian law relating to non-pecuniary damage.\n\nUnder the Pinto Act, only the years beyond an average period that could be regarded as “reasonable” had to be taken into account when assessing the damage. Furthermore, the existence of non-pecuniary damage did not implicitly flow from the finding of a violation. On the contrary, non-pecuniary damage had to be determined and proved in accordance with the relevant provisions of the Civil Code. The Court of Cassation had asserted, though, that non-pecuniary damage was a normal consequence of a breach of the reasonable-time requirement that from then on did not have to be proved by the applicant. According to the Court of Cassation, it was up to the State to provide proof that in a particular case an inordinately long wait for a judgment had not occasioned the applicant any anxiety or distress but, on the contrary, had been advantageous or that the applicant had been aware of having instituted or contested proceedings on the basis of erroneous arguments (Court of Cassation, 29 March-11 May 2004, no. 8896), for example, where the applicant had been well aware from the outset that he or she had no chance of success.\n\n156.  The Government observed lastly that, under Article 41 of the Convention, the Court awarded just satisfaction if appropriate, and sometimes held that a finding of a violation sufficed. That possibility should also be available to the States, which should also be able to vary the amounts they awarded, even to the point of awarding nothing in some cases.\n\n157.  The Government then asked the Court to clarify the various aspects of the reasoning that led to its decisions, both in respect of the parts relating to a violation and those regarding just satisfaction. They submitted that the Court should follow the approach used by the domestic courts and explain in each case how many years had to be regarded as “natural” for each stage of proceedings, how many might be acceptable having regard to the complexity of the case, how many delays were attributable to each party, the importance of the stakes in the proceedings, the outcome of the proceedings and how the just satisfaction to be awarded was calculated on the basis of those factors.\n\n158.  At the hearing the Government indicated, lastly, that as far as the procedural costs were concerned the applicants had obtained only partial reimbursement from the courts because one of the parties against which the proceedings had been instituted could not be considered a party to the proceedings.\n\n159.  For all the foregoing reasons, the Government argued that the applicants should no longer be regarded as “victims” of a violation due to the excessive length of the proceedings.\n\n(b)  The applicants\n\n160.  The applicants submitted that they were still “victims” of the alleged violation because the amount awarded them by the Court of Appeal was derisory and bore no relation whatsoever to the levels of compensation awarded by the Court.\n\n161.  Relying on Holzinger v.  (no. 1) (no. 23459/94, § 21, ECHR 2001-I), the applicants submitted that the Court had power to assess the amount of the compensation received at domestic level in order to determine whether they had victim status. In so doing, it could compare that amount with the amount it would itself have awarded in just satisfaction.\n\n162.  The applicants disputed the contention that once a finding of a breach of the “reasonable time” requirement had been made, it was possible not to award any compensation. In their submission, where the courts found that the proceedings had been excessive in length, it meant that the interested parties had had time “stolen” from them. As that time could not be given back, it was necessary to award pecuniary compensation. Failing that, the violation persisted. In that connection the applicants referred to “minimum damage” implicitly flowing from a finding of a violation and which would be the same for everyone. To that minimum amount should be added sums that took account of other factors, such as the stakes involved for the person, to be evaluated on a case-by-case basis.\n\n163.  Given that the remedy introduced by the Pinto Act was only compensatory, and in the absence of any remedy capable of preventing the breach, the applicants maintained that the compensation – in order to be deemed capable of making good the alleged loss – had to be of a sufficient level, that is, bear a reasonable relation to the amounts awarded by the Court.\n\nMoreover, the applicants pointed out that the amounts awarded by the domestic courts in defamation or personal injury cases were significantly higher than the amounts awarded by the Court under the head of non-pecuniary damage in length-of-proceedings cases.\n\n164.  In conclusion, a comparison between the compensation received at national level and the amounts awarded by the Court in just satisfaction was not only possible, but necessary.\n\n165.  The applicants observed that the amount awarded them in compensation under the Pinto Act was EUR 2,450. According to the Chamber, that amount corresponded to about 10% of the amount that the Court would have awarded in a similar case. Furthermore, the legal costs payable by them came to EUR 1,500, plus 20% VAT (value-added tax) and 2% CPA (contribution to the lawyers’ insurance fund), that is, EUR 1,834. Accordingly, the compensation actually awarded, after deduction of legal costs, came to EUR 614, that is, EUR 153.50 each.\n\n3.  Third-party interveners\n\n(a)  The Czech Government\n\n166.  In the Czech Government’s submission, the Court should confine itself to ensuring that the consequences of the case-law policy choices made by the domestic courts were in keeping with the Convention. Its review should be more or less rigorous, depending on the margin of appreciation that the Court allowed national authorities. The Court should only ensure that, in accordance with Article 13 of the Convention, the national authorities complied with the principles established in its case-law or applied the provisions of their own domestic law in such a way that applicants enjoyed a level of protection in respect of their rights and freedoms as guaranteed by the Convention that was greater than or equivalent to that which they would enjoy if the national authorities applied the Convention’s provisions directly. The Court should not go any further except in cases where the result arrived at by the national authorities appeared, on the face of it, arbitrary.\n\n167.  The Czech Government acknowledged that the adequacy of the amount awarded at domestic level was one of the criteria of effectiveness of an application for compensation within the meaning of Article 13. However, in view of the wide margin of appreciation that should be available to the Contracting Parties in implementing Article 13, they considered that the Court should subsequently exercise only “limited control”, thus restricted to satisfying itself that the national authorities had not made a “manifest error in assessment” of the non-pecuniary damage caused by the excessive length of judicial proceedings.\n\n168.  Moreover, as the Czech Government wanted to provide their country with a compensatory remedy in addition to the existing preventive domestic remedy, they asked the Court to provide as many guidelines as possible in that connection so that they could put in place a remedy which would incontestably be effective.\n\n(b)  The Polish Government\n\n169.  In the Polish Government’s submission, an assessment of the facts of the case with a view to determining whether the “reasonable time” had been exceeded was part of the examination of the evidence conducted by the domestic courts. It was therefore debatable to what extent a supranational body could intervene in this process. It was, rather, commonly accepted that in most cases the facts would have been established by the domestic courts and that the Court’s task would be limited to examining whether the Convention had been complied with. The Court’s case-law appeared to be confined to assessing whether the domestic courts’ decisions, given in accordance with domestic procedure previously approved by the Court, had properly applied the general rules to the specific case. In the absence of precise indicators on which to assess the facts and calculate the amount of compensation, there were no grounds on which to dispute the decisions of the domestic courts. Regard should be had in this connection to the discretion available to the domestic courts in assessing the facts and the evidence.\n\n170.  Furthermore, in the very particular circumstances of some cases, the mere finding of a violation sufficed to meet the requirement of an effective remedy and amounted to adequate redress. That rule had been clearly established in the Court’s case-law on other Articles of the Convention. In some cases, moreover, the excessive length of the proceedings could be favourable to the parties and compensating them would therefore be extremely questionable.\n\n(c)  The Slovakian Government\n\n171.  In the Slovakian Government’s submission, the Court should adopt the same approach as in assessing the fairness of proceedings, a matter in respect of which it considered that its task was not to deal with the factual or legal mistakes allegedly made by the domestic courts unless such mistakes could have resulted in a breach of the rights and freedoms guaranteed by the Convention. Moreover, although Article 6 of the Convention guaranteed the right to a fair trial, it did not lay down any rules on the admissibility of evidence or its assessment, which was therefore primarily a matter for regulation under national law by the domestic courts. Accordingly, when examining decisions of domestic courts on the amount awarded for non-pecuniary damage arising from delays in proceedings, the Court should leave enough room for the courts’ discretion in this respect since the domestic courts decided on delays in the proceedings on the basis of the same criteria as the Court – and were in a better position to analyse the causes and consequences and thus to determine the non-pecuniary damage on an equitable basis.\n\n172.  The Slovakian Government pointed out that the decisions of the  concerning delays in proceedings were much more detailed than the Court’s decisions. In their submission, the Court should examine the decisions of the domestic courts relating to the amounts awarded for non-pecuniary damage only with regard to whether these decisions were manifestly arbitrary and unfair and not whether the amounts awarded by the Court in similar circumstances were substantially higher. Moreover, the Slovakian Government found it logical that the amounts awarded by the domestic courts for protractedness of proceedings were less than the amounts awarded by the Court because injured persons could obtain effective and rapid compensation in their own country without having to bring their case to the international court.\n\n4.  The Court’s assessment\n\n(a)  Reiteration of the context peculiar to length-of-proceedings cases\n\n173.  The Court will begin by responding to the observations of the different Governments regarding the lack of precision in its judgments both in respect of the reasons leading to a finding of a violation and awards in respect of non-pecuniary damage.\n\n174.  It feels it important to point out that the reason it has been led to rule on so many length-of-proceedings cases is because certain Contracting Parties have for years failed to comply with the “reasonable time” requirement under Article 6 § 1 and have not provided a domestic remedy for this type of complaint.\n\n175.  The situation has worsened on account of the large number of cases coming from certain countries, of which  is one. The Court has already had occasion to stress the serious difficulties it has had as a result of Italy’s inability to resolve the situation. It has expressed itself on the subject in the following terms:\n\n“The Court next draws attention to the fact that since 25 June 1987, the date of the Capuano v. Italy judgment (Series A no. 119), it has already delivered 65 judgments in which it has found violations of Article 6 § 1 in proceedings exceeding a “reasonable time” in the civil courts of the various regions of Italy. Similarly, under former Articles 31 and 32 of the Convention, more than 1,400 reports of the Commission resulted in resolutions by the Committee of Ministers finding  in breach of Article 6 for the same reason.\n\nThe frequency with which violations are found shows that there is an accumulation of identical breaches which are sufficiently numerous to amount not merely to isolated incidents. Such breaches reflect a continuing situation that has not yet been remedied and in respect of which litigants have no domestic remedy.\n\nThis accumulation of breaches accordingly constitutes a practice that is incompatible with the Convention.” (see Bottazzi v. Italy [GC], no. 34884/97, § 22, ECHR 1999V; Ferrari v. Italy [GC], no. 33440/96, § 21, ; A.P. v. Italy [GC], no. 35265/97, § 18, 28 July 1999; and Di Mauro v. Italy [GC], no. 34256/96, § 23, ECHR 1999-V)\n\n176.  Thus the Court, like the Commission, after years of examining the reasons for the delays attributable to the parties under the Italian procedural rules, has had to resolve to standardise its judgments and decisions. This has allowed it to adopt more than 1,000 judgments against  since 1999 in civil length-of-proceedings cases. That approach has made it necessary to establish scales on equitable principles for awards in respect of non-pecuniary damage under Article 41, in order to arrive at equivalent results in similar cases.\n\nAll this has led the Court to award higher levels of compensation than those awarded by the Convention institutions prior to 1999, and which may differ from those applied in the event of a finding of other violations. This increase, far from being a punitive measure, was intended to serve two purposes. On the one hand it encouraged States to find their own, universally accessible, solution to the problem, and on the other hand it allowed applicants to avoid being penalised for the lack of domestic remedies.\n\n177.  The Court also considers it important to point out that it keeps to its constant practice regarding the assessment of the delays and regarding just satisfaction. Concerning the question of exceeding a reasonable time, it reiterates that regard must be had to the circumstances of the case and the criteria laid down in the Court’s case-law, in particular the complexity of the case, the applicant’s conduct and that of the competent authorities, and the importance of what was at stake for the applicant in the dispute (see, among many other authorities, Comingersoll S.A., cited above, § 19). Furthermore, a closer analysis of the many judgments which post-date Bottazzi will enable the Government to see that there is a clear pattern in the amounts awarded in its judgments, since the amounts differ only in respect of the particular facts of each case.\n\n(b)  Principles established under the Court’s case-law\n\n178.  With regard to the observations concerning the subsidiarity principle, also made by the third parties, the Court notes that under Article 34 of the Convention it “... may receive applications from any person ... claiming to be the victim of a violation by one of the High Contracting Parties of the rights set forth in the Convention or the Protocols thereto. ...”.\n\n179.  The Court reiterates that it falls first to the national authorities to redress any alleged violation of the Convention. In this regard, the question whether an applicant can claim to be a victim of the violation alleged is relevant at all stages of the proceedings under the Convention (see Burdov v. Russia, no. 59498/00, § 30, ECHR 2002-III).\n\n180.  The Court also reiterates that a decision or measure favourable to the applicant is not in principle sufficient to deprive him of his status as a “victim” unless the national authorities have acknowledged, either expressly or in substance, and then afforded redress for, the breach of the Convention (see, for example, Eckle v. Germany, 15 July 1982, §§ 69 et seq., Series A no. 51; Amuur v. France, 25 June 1996, § 36, Reports 1996-III; Dalban v. Romania [GC], no. 28114/95, § 44, ECHR 1999-VI; and Jensen v. Denmark (dec.), no. 48470/99, ECHR 2001-X).\n\n181.  The issue as to whether a person may still claim to be the victim of an alleged violation of the Convention essentially entails on the part of the Court an ex post facto examination of his or her situation. As it has already held in other length-of-proceedings cases, the question whether he or she has received reparation for the damage caused – comparable to just satisfaction as provided for under Article 41 of the Convention – is an important issue. It is the Court’s settled case-law that where the national authorities have found a violation and their decision constitutes appropriate and sufficient redress, the party concerned can no longer claim to be a victim within the meaning of Article 34 of the Convention (see Holzinger (no. 1), cited above, § 21).\n\n182.  In so far as the parties appear to link the issue of victim status to the more general question of effectiveness of the remedy and seek guidelines on providing the most effective domestic remedies possible, the Court proposes to address the question in a wider context by giving certain indications as to the characteristics such a domestic remedy should have, having regard to the fact that, in this type of case, the applicant’s ability to claim to be a victim will depend on the redress the domestic remedy will have afforded him or her.\n\n183.  The best solution in absolute terms is indisputably, as in many spheres, prevention. The Court observes that it has stated on many occasions that Article 6 § 1 imposes on the Contracting States the duty to organise their judicial systems in such a way that their courts can meet each of its requirements, including the obligation to hear cases within a reasonable time (see, among many other authorities, Süßmann v. Germany, 16 September 1996, § 55, Reports 1996-IV, and Bottazzi, cited above, § 22). Where the judicial system is deficient in this respect, a remedy designed to expedite the proceedings in order to prevent them from becoming excessively lengthy is the most effective solution. Such a remedy offers an undeniable advantage over a remedy affording only compensation since it also prevents a finding of successive violations in respect of the same set of proceedings and does not merely repair the breach a posteriori, as does a compensatory remedy of the type provided for under Italian law for example.\n\n184.  The Court has on many occasions acknowledged that this type of remedy is “effective” in so far as it hastens the decision by the court concerned (see, among other authorities, Bacchini v. Switzerland (dec.), no. 62915/00, 21 June 2005; Kunz v. Switzerland (dec.), no. 623/02, 21 June 2005; Fehr and Lauterburg v. Switzerland (dec.), nos. 708/02 and 1095/02, 21 June 2005; Gonzalez Marin v. Spain (dec.), no. 39521/98, ECHR 1999VII; Tomé Mota v. Portugal (dec.), no. 32082/96, ECHR 1999-IX; and Holzinger (no. 1), cited above, § 22).\n\n185.  It is also clear that for countries where length-of-proceedings violations already exist, a remedy designed to expedite the proceedings – although desirable for the future – may not be adequate to redress a situation in which the proceedings have clearly already been excessively long.\n\n186.  Different types of remedy may redress the violation appropriately. The Court has already affirmed this in respect of criminal proceedings, where it was satisfied that the length of proceedings had been taken into account when reducing the sentence in an express and measurable manner (see Beck v. Norway, no. 26390/95, § 27, ).\n\nMoreover, some States, such as Austria, Croatia, Spain, Poland and Slovakia, have understood the situation perfectly by choosing to combine two types of remedy, one designed to expedite the proceedings and the other to afford compensation (see, for example, Holzinger (no. 1), cited above, § 22; Slaviček v. Croatia (dec.), no. 20862/02, ECHR 2002-VII; Fernández-Molina González and Others v. Spain (dec.), no. 64359/01, ECHR 2002-IX; Michalak v. Poland (dec.), no. 24549/03, 1 March 2005; and Andrášik and Others v. Slovakia (dec.), nos. 57984/00, 60237/00, 60242/00, 60679/00, 60680/00, 68563/01 and 60226/00, ECHR 2002-IX).\n\n187.  However, States can also choose to introduce only a compensatory remedy, as  has done, without that remedy being regarded as ineffective (see Mifsud, cited above).\n\n188.  In Kudła (cited above, §§ 154-55) the Court already had occasion to reiterate that, subject to compliance with the requirements of the Convention, the Contracting States are afforded some discretion as to the manner in which they provide individuals with the relief required by Article 13 and conform to their Convention obligation under that provision. It has also stressed the importance of the rules relating to the subsidiarity principle so that individuals are not systematically forced to refer to the Court in  complaints that could otherwise, and in the Court’s opinion more appropriately, have been addressed in the first place within the national legal system.\n\n189.  Accordingly, where the legislature or the domestic courts have agreed to play their proper role by introducing a domestic remedy, the Court will clearly have to draw certain conclusions from this. Where a State has taken a significant step by introducing a compensatory remedy, the Court must leave a wider margin of appreciation to the State to allow it to organise the remedy in a manner consistent with its own legal system and traditions and consonant with the standard of living in the country concerned. It will, in particular, be easier for the domestic courts to refer to the amounts awarded at domestic level for other types of damage – personal injury, damage relating to a relative’s death or damage in defamation cases, for example – and rely on their innermost conviction, even if that results in awards of amounts that are lower than those fixed by the Court in similar cases.\n\n190.  In accordance with its case-law on the interpretation and application of domestic law, while the Court’s duty, under Article 19 of the Convention, is to ensure the observance of the engagements undertaken by the Contracting Parties to the Convention, it is not its function to deal with errors of fact or law allegedly committed by a national court unless and in so far as they may have infringed rights and freedoms protected by the Convention. Moreover, it is primarily for the national authorities, notably the courts, to interpret and apply domestic law (see Jahn and Others, cited above, § 86).\n\n191.  The Court is therefore required to verify whether the way in which the domestic law is interpreted and applied produces consequences that are consistent with the principles of the Convention, as interpreted in the light of the Court’s case-law. This is especially true where, as the Italian Court of Cassation has quite rightly observed, the domestic law refers explicitly to the provisions of the Convention. This supervisory role should be easier in respect of States that have effectively incorporated the Convention into their legal system and consider the rules to be directly applicable, since the highest courts of these States will normally assume responsibility for enforcing the principles determined by the Court.\n\nAccordingly, a clear error in assessment on the part of the domestic courts may also arise as a result of a misapplication or misinterpretation of the Court’s case-law.\n\n192.  The principle of subsidiarity does not mean renouncing all supervision of the result obtained from using domestic remedies, otherwise the rights guaranteed by Article 6 would be devoid of any substance. In that connection it should be reiterated that the Convention is intended to guarantee not theoretical or illusory rights, but rights that are practical and effective (see Prince Hans-Adam II of Liechtenstein v. Germany [GC], no. 42527/98, § 45, ECHR 2001-VIII). This is particularly true for the guarantees enshrined in Article  view of the prominent place held in a democratic society by the right to a fair trial with all the guarantees under Article 6 (ibid.)\n\n(c)  Application of the foregoing principles\n\n193.  It follows from the foregoing principles that the Court is required to verify that there has been an acknowledgment, at least in substance, by the authorities of a violation of a right protected by the Convention and whether the redress can be considered as appropriate and sufficient (see, inter alia, Normann v. Denmark (dec.), no. 44704/98, 14 June 2001; Jensen and Rasmussen v. Denmark (dec.), no. 52620/99, 20 March 2003; and Nardone v. Italy (dec.), no. 34368/02, 25 November 2004).\n\n(i)  The finding of a violation\n\n194.  The first condition, which is the finding of a violation by the national authorities, is not in issue since if an appeal court were to award damages without having first expressly found a violation, the Court would necessarily conclude that such a finding had been made in substance as, under the Pinto Act, an appeal court cannot make an award unless a reasonable time has been exceeded (see Capogrossi v. Italy (dec.), no. 62253/00, ).\n\n(ii)  The characteristics of the redress\n\n195.  With regard to the second condition, namely, appropriate and sufficient redress, the Court has already indicated that even if a remedy is “effective” in that it allows for an earlier decision by the courts to which the case has been referred or for the aggrieved party to be given adequate compensation for the delays that have already occurred, that conclusion applies only on condition that an application for compensation remains itself an effective, adequate and accessible remedy in respect of the excessive length of judicial proceedings (see Mifsud, cited above).\n\nIndeed, it cannot be ruled out that excessive delays in an action for compensation will render the remedy inadequate (see Paulino Tomás v. Portugal (dec.), no. 58698/00, ECHR 2003-VIII; Belinger v. Slovenia (dec.), no. 42320/98, 2 October 2001; and, mutatis mutandis, Öneryıldız v. Turkey [GC], no. 48939/99, § 156, ECHR 2004-XII).\n\n196.  In that connection the Court reiterates its case-law to the effect that the right of access to a tribunal guaranteed by Article 6 § 1 of the Convention would be illusory if a Contracting State’s domestic legal system allowed a final, binding judicial decision to remain inoperative to the detriment of one party. Execution of a judgment given by any court must therefore be regarded as an integral part of the “trial” for the purposes of Article 6 (see, inter alia, Hornsby v. Greece, 19 March 1997, §§ 40 et seq., Reports 1997-II, and Metaxas v. Greece, no. 8415/02, § 25, 27 May 2004).\n\n197.  The Court has pointed out in civil length-of-proceedings cases that the enforcement proceedings are the second stage of the proceedings and that the right asserted does not actually become effective until enforcement (see, among other authorities, Di Pede v. Italy and Zappia v. Italy, 26 September 1996, §§ 22, 24 and 26 and §§ 18, 20 and 22 respectively, Reports 1996-IV, and, mutatis mutandis, Silva Pontes v. Portugal, , § 33, Series A no. 286-A).\n\n198.  The Court has also stated that it is inappropriate to require an individual who has obtained judgment against the State at the end of legal proceedings to then bring enforcement proceedings to obtain satisfaction. It follows that the late payment, following enforcement proceedings, of amounts owing to the applicant cannot cure the national authorities’ long-standing failure to comply with a judgment and does not afford adequate redress (see Metaxas, cited above, § 19, and Karahalios v. Greece, no. 62503/00, § 23, 11 December 2003). Moreover, some States, such as  and , have even stipulated a time-limit in which payment should be made, namely two and three months respectively (see Andrášik and Others and Slaviček, both cited above).\n\nThe Court can accept that the authorities need time in which to make payment. However, in respect of a compensatory remedy designed to redress the consequences of excessively lengthy proceedings, that period should not generally exceed six months from the date on which the decision awarding compensation becomes enforceable.\n\n199.  As the Court has already noted on many occasions, it is not open to a State authority to cite lack of funds as an excuse for not honouring a judgment debt (see, among many other authorities, Burdov, cited above, § 35).\n\n200.  With regard to the concern to have a remedy affording compensation that complies with the reasonable-time requirement, it may well be that the procedural rules are not exactly the same as for ordinary applications for damages. It is for each State to determine, on the basis of the rules applicable in its judicial system, which procedure will best meet the compulsory criterion of “effectiveness”, provided that the procedure conforms to the principles of fairness guaranteed by Article 6 of the Convention.\n\n201.  Lastly, the Court finds it reasonable that in this type of proceedings where the State, on account of the poor organisation of its judicial system, forces litigants – to some extent – to have recourse to a compensatory remedy, the rules regarding legal costs may be different and thus avoid placing an excessive burden on litigants where their action is justified. It might appear paradoxical that, by imposing various taxes – payable prior to the lodging of an application or after the decision – the State takes away with one hand what it has awarded with the other to repair a breach of the Convention. Nor should the costs be excessive and constitute an unreasonable restriction on the right to lodge such an application and thus an infringement of the right of access to a tribunal. On this point the Court notes that in  applicants are reimbursed the court fee payable on lodging a complaint if their complaint is considered justified (see Charzyński v. Poland (dec.), no. 15212/03, ECHR 2005-V).\n\n202.  Regarding violations of the reasonable-time requirement, one of the characteristics of sufficient redress which may remove a litigant’s victim status relates to the amount awarded as a result of using the domestic remedy. The Court has already had occasion to indicate that an applicant’s victim status may depend on the level of compensation awarded at domestic level on the basis of the facts about which he or she complains before the Court (see Normann and Jensen and Rasmussen, both cited above).\n\n203.  With regard to pecuniary damage, the domestic courts are clearly in a better position to determine the existence and quantum. Moreover, that point has not been disputed by the parties or interveners.\n\n204.  Regarding non-pecuniary damage, the Court – like the Italian Court of Cassation (see its judgment no. 8568/05, paragraph 70 above) – assumes that there is a strong but rebuttable presumption that excessively long proceedings will occasion non-pecuniary damage. It also accepts that, in some cases, the length of proceedings may result in only minimal non-pecuniary damage or no non-pecuniary damage at all (see Nardone, cited above). The domestic courts will then have to justify their decision by giving sufficient reasons.\n\n205.  Moreover, in the Court’s view, the level of compensation depends on the characteristics and effectiveness of the domestic remedy.\n\n206.  The Court can also perfectly well accept that a State which has introduced a number of remedies, one of which is designed to expedite proceedings and one to afford compensation, will award amounts which – while being lower than those awarded by the Court – are not unreasonable, on condition that the relevant decisions, which must be consonant with the legal tradition and the standard of living in the country concerned, are speedy, reasoned and executed very quickly (see Dubjakova v. Slovakia (dec.), no. 67299/01, 19 October 2004).\n\nHowever, where the domestic remedy has not met all the foregoing requirements, it is possible that the threshold in respect of which the amount will still allow a litigant to claim to be a “victim” will be higher.\n\n207.  It is even conceivable that the court determining the amount of compensation will acknowledge its own delay and that accordingly, and in order not to penalise the applicant later, it will award a particularly high amount of compensation in order to make good the further delay.\n\n(iii)  Application to the present case\n\n208.  The four-month period pred by the Pinto Act complies with the requirement of speediness necessary for a remedy to be effective. In the instant case the  Court of Appeal’s examination of the “Pinto” application lasted from  until , that is, less than four months, which is within the statutory period.\n\n209.  In the present case the applicants did not allege that there were delays in paying the compensation awarded. The Court would nonetheless stress the fact that, in order to be effective, a compensatory remedy must be accompanied by adequate budgetary provision so that effect can be given, within six months of their being deposited with the registry, to decisions of the courts of appeal awarding compensation, which, in accordance with the Pinto Act, are immediately enforceable (section 3(6) of the Pinto Act – see paragraph 62 above).\n\n210.  As regards procedural costs, the applicants had to bear costs amounting to approximately two-thirds of the compensation awarded. In that connection, the Court considers that the rate of procedural costs, and particularly certain fixed expenses (such as registration of the judicial decision), may significantly hamper the efforts made by applicants to obtain compensation.\n\n211.  In assessing the amount of compensation awarded by the court of appeal, the Court considers, on the basis of the material in its possession, what it would have done in the same position for the period taken into account by the domestic court.\n\n212.  According to the documents provided by the parties for the hearing, there is no disproportion in  between the amounts awarded to heirs for non-pecuniary damage in the event of a relative’s death or those awarded for physical injury or in defamation cases and those generally awarded by the Court under Article  length-of-proceedings cases. Accordingly, the level of compensation generally awarded by the courts of appeal in “Pinto” applications cannot be justified by this type of consideration.\n\n213.  Even if the method of calculation provided for in domestic law does not correspond exactly to the criteria established by the Court, an analysis of the case-law should enable the courts of appeal to award sums that are not unreasonable in comparison with the awards made by the Court in similar cases.\n\n214.  In the instant case the Court notes that the Court of Appeal did not find that the conduct of the applicants had had a significant effect on the length of the proceedings. Nor did it find that the case was particularly complex. The Court of Appeal’s decision appears to take account only of the excessive length, assessed at three years and six months, and the stakes involved in the dispute. The Court reiterates that the stakes involved in the dispute cannot be assessed with regard only to the final outcome, otherwise proceedings that are still pending would have no value. Regard has to be had to the overall stakes involved in the dispute for the applicants.\n\nWith regard to the amount awarded, it would appear that EUR 2,450 for a delay of three and a half years amounts to applying a rate of EUR 700 per annum, that is, EUR 175 for each applicant. The Court observes that this amount is approximately 10% of what it generally awards in similar Italian cases. That factor in itself leads to a result that is manifestly unreasonable having regard to its case-law. It will return to this matter in the context of Article 41 (see paragraphs 272-73 below).\n\n215.  In conclusion, and having regard to the fact that various requirements have not been satisfied, the Court considers that the redress was insufficient. As the second condition – appropriate and sufficient redress – has not been fulfilled, the Court considers that the applicants can in the instant case still claim to be “victims” of a breach of the “reasonable time” requirement.\n\n216.  Accordingly, this objection by the Government must also be dismissed.\n\nC.  Compliance with Article 6 § 1 of the Convention\n\n217.  In its judgment, the Chamber found that there had been a breach of Article 6 § 1 because the length of the proceedings did not satisfy the reasonable-time requirement and that this was another example of the practice referred to in Bottazzi (see paragraphs 69-70 of the Chamber judgment).\n\n218.  The applicants complained of the derisory amount of damages awarded. Nor did they see how the Pinto Act could prevent further violations and pointed out that the Committee of Ministers of the Council of Europe considered that the situation of length-of-proceedings cases in  was still very serious. They therefore asked the Grand Chamber to endorse the wording of the Chamber judgment.\n\n219.  The Government disputed the wording adopted in Bottazzi (cited above, § 22) regarding the existence of a “practice” incompatible with the Convention, since in the present case there had not been any tolerance on the part of the State, which had taken numerous measures, including the Pinto Act, to prevent further violations.\n\n1.  Period to be taken into consideration\n\n220.  The Court observes that its case-law on the intervention of third parties in civil proceedings makes the following distinction: where the applicant has intervened in domestic proceedings only on his or her own behalf the period to be taken into consideration begins to run from that date, whereas if the applicant has declared his or her intention to continue the proceedings as heir he or she can complain of the entire length of the proceedings (see, as the most recent authority, M.Ö. v. Turkey, no. 26136/95, § 25, 19 May 2005).\n\n221.  The period to be taken into consideration therefore began on , when Mr A. Scordino brought proceedings against the defendants in the  Court of Appeal, and ended on , when the Court of Cassation’s judgment was deposited with the registry. It therefore lasted just over eight and a half years for two levels of jurisdiction.\n\n2.  Reasonableness of the length of the proceedings\n\n222.  The Court has already reiterated the reasons that led it to conclude in the four judgments against  of 28 July 1999 (Bottazzi, § 22; Ferrari, § 21; A.P. v. Italy, § 18; and Di Mauro, § 23) that there was a practice in  (see paragraph 175 above).\n\n223.  It notes that, as the Government have stressed, a domestic remedy has since been introduced. However, that has not changed the substantive problem, namely, the fact that the length of proceedings in  continues to be excessive. The annual reports of the Committee of Ministers on the excessive length of judicial proceedings in  (see, inter alia, /Inf/DH(2004)23 revised, and Interim Resolution ResDH(2005)114) scarcely seem to reflect substantial changes in this area. Like the applicants, the Court does not see how the introduction of the Pinto remedy at domestic level has solved the problem of excessively lengthy proceedings. It has admittedly saved the Court the trouble of finding these violations, but the task has simply been transferred to the courts of appeal, which were already overburdened themselves. Furthermore, given the occasional divergence between the case-law of the Court of Cassation (see paragraphs 63-70 above) and that of the Court, the latter is again required to give a decision as to the existence of such violations.\n\n224.  The Court emphasises once again that Article 6 § 1 of the Convention obliges the Contracting States to organise their legal systems so as to enable the courts to comply with its various requirements. It wishes to reaffirm the importance of administering justice without delays which might jeopardise its effectiveness and credibility (see Bottazzi, cited above, § 22). Italy’s position in this regard has not changed sufficiently to call into question the conclusion that this accumulation of breaches constitutes a practice that is incompatible with the Convention.\n\n225.  The Court notes that in the present case the Court of Appeal found that a reasonable time had been exceeded. However, the fact that the “Pinto” proceedings, examined as a whole, did not cause the applicants to lose their “victim” status constitutes an aggravating circumstance regarding a breach of Article 6 § 1 for exceeding the reasonable time. The Court will therefore return to this issue in the context of Article 41.\n\n226.  After examining the facts in the light of the information provided by the parties and the aforementioned practice, and having regard to its case-law on the subject, the Court considers that in the present case the length of the proceedings was excessive and failed to meet the “reasonable time” requirement.\n\n227.  Accordingly, there has been a violation of Article 6 § 1 of the Convention.\n\nIV.  APPLICATION OF ARTICLES 46 AND 41 OF THE CONVENTION\n\nA.  Article 46 of the Convention\n\n228.  Under this provision,\n\n“1.  The High Contracting Parties undertake to abide by the final judgment of the Court in any case to which they are parties.\n\n2.  The final judgment of the Court shall be transmitted to the Committee of Ministers, which shall supervise its execution.”\n\n1.  Compensation for expropriation\n\n229.  The Court’s conclusions suggest in themselves that the violation of the applicants’ right guaranteed under Article 1 of Protocol No. 1 originated in a widespread problem arising out of a malfunctioning of the Italian legislation which has affected, and may still affect in the future, a large number of people. The unjustified hindrance in obtaining compensation for expropriation “reasonably related to the value of the property” was not caused by an isolated incident; neither is it attributable to the particular turn taken by events in the case of the applicants. It arises from the application of a law to a specific category of citizens, namely, persons affected by the expropriation of land.\n\n230.  The existence and systemic nature of this problem have not been acknowledged by the Italian judicial authorities. However, certain passages of judgment no. 223 of 1983 (see paragraph 55 above) and nos. 283 and 442 of 1993 (see paragraph 60 above) of the Constitutional Court, in which the court calls on the legislature to frame a law making provision for substantial compensation (serio ristoro) and holds that section 5 bis of Law no. 359/1992 is compatible with the Constitution on account of its urgent and temporary nature, indicate that the Constitutional Court has detected an underlying structural problem to which the legislature should find a solution.\n\nIn the Court’s view, the facts of the case disclose the existence, within the Italian legal order, of a shortcoming as a consequence of which an entire category of individuals have been, or are still being, deprived of their right to the peaceful enjoyment of their possessions. It also finds that the legal loopholes detected in the applicants’ particular case may subsequently give rise to numerous well-founded applications, having regard also to the fact that the Expropriation Code has codified the compensation criteria introduced by section 5 bis of Law no. 359/1992 (see paragraph 61 above).\n\n231.  As part of the measures designed to guarantee the effectiveness of the machinery established by the Convention, the Committee of Ministers of the Council of Europe adopted on 12 May 2004 Resolution Res(2004)3 on judgments revealing an underlying systemic problem in which, after emphasising the interest in helping the State concerned to identify the underlying problems and the necessary execution measures (seventh paragraph of the preamble), it invited the Court “to identify, in its judgments finding a violation of the Convention, what it considers to be an underlying systemic problem and the source of this problem, in particular when it is likely to give rise to numerous applications, so as to assist States in finding the appropriate solution and the Committee of Ministers in supervising the execution of judgments” (paragraph I of the Resolution). That Resolution has to be replaced in the context of the increase in the Court’s workload, owing to, inter alia, a series of cases resulting from the same structural or systemic cause.\n\n232.  In that connection the Court draws attention to the Recommendation of the Committee of Ministers of 12 May 2004 (Rec(2004)6) on the improvement of domestic remedies, in which the Committee of Ministers reiterated that, in addition to the obligation under Article 13 of the Convention to ensure that anyone who has an arguable complaint has an effective remedy before a national authority, the States have the general obligation to solve the problems underlying violations found. Emphasising that the improvement of remedies at national level, particularly in respect of repetitive cases, should also contribute to reducing the workload of the Court, the Committee of Ministers recommended that member States review, following Court judgments which point to structural or general deficiencies in national law or practice, the effectiveness of the existing domestic remedies and, “where necessary, set up effective remedies, in order to avoid repetitive cases being brought before the Court”.\n\n233.  Before examining the claims for just satisfaction submitted by the applicants under Article 41 of the Convention, and having regard to the circumstances of the case and the evolution of its workload, the Court will examine what consequences may be drawn from Article 46 of the Convention for the respondent State. It reiterates that, under Article 46, the High Contracting Parties undertake to abide by the final judgments of the Court in any case to which they are parties, execution being supervised by the Committee of Ministers.  of the effects of this is that where the Court finds a violation, the respondent State has a legal obligation not just to pay those concerned the sums awarded by way of just satisfaction under Article 41, but also to select, subject to supervision by the Committee of Ministers, the general and/or, if appropriate, individual measures to be adopted in their domestic legal order to put an end to the violation found by the Court and to redress as far as possible the effects. The respondent State remains free, subject to monitoring by the Committee of Ministers, to choose the means by which it will discharge its legal obligation under Article 46 of the Convention, provided that such means are compatible with the conclusions set out in the Court’s judgment (see Scozzari and Giunta v. Italy [GC], nos. 39221/98 and 41963/98, § 249, ECHR 2000-VIII, and Broniowski, cited above, § 192).\n\n234.  Furthermore, under the Convention, particularly Article 1, in ratifying the Convention the Contracting States undertake to ensure that their domestic law is compatible with the Convention (see Maestri v.  [GC], no. 39748/98, § 47, ECHR 2004-I).\n\n235.  The Court has already noted that the violation it has found in the present case arose from a situation affecting a large number of people, namely, the category of individuals whose land was expropriated (see paragraphs 99-104 above). There are already dozens of applications before the Court that have been lodged by persons affected by an expropriation of property to which the impugned compensation criteria apply. That is not only an aggravating factor as regards the State’s responsibility under the Convention for a past or present situation, but is also a threat for the future effectiveness of the system put in place by the Convention.\n\n236.  In theory it is not for the Court to determine what may be the appropriate measures of redress for a respondent State to take in accordance with its obligations under Article 46 of the Convention. However, having regard to the systemic situation which it has identified, the Court would observe that general measures at national level are undoubtedly called for in the execution of the present judgment, measures which must take into consideration the large number of people affected. Furthermore, the measures taken must be such as to remedy the systemic defect underlying the Court’s finding of a violation, so that the system established by the Convention is not compromised by a large number of applications arising out of the same cause. Such measures must therefore include a mechanism for providing injured persons with compensation for the violation of the Convention established in the present judgment concerning the applicants. In that connection the Court’s concern is to facilitate the rapid and effective suppression of a malfunction found in the national system of human rights protection. Once such a deficiency has been identified, the national authorities have the task, subject to supervision by the Committee of Ministers, of taking – retrospectively if necessary (see Bottazzi, § 22, and Di Mauro, § 23, both cited above, and the Interim Resolution of the Committee of Ministers ResDH(2000)135 of 25 October 2000 (Excessive length of judicial proceedings in Italy: general measures); see also Brusco, cited above, and Giacometti and Others v. Italy (dec.), no. 34939/97, ECHR 2001-XII) – the necessary measures of redress in accordance with the principle of subsidiarity under the Convention, so that the Court does not have to reiterate its finding of a violation in a long series of comparable cases.\n\n237.  In order to assist the respondent State in complying with its obligations under Article 46, the Court has attempted to indicate the type of measures the  could take in order to put an end to the systemic situation found in the present case. It considers that the respondent State should, above all, remove every obstacle to the award of compensation bearing a reasonable relation to the value of the expropriated property, and thus ensure, by appropriate statutory, administrative and budgetary measures, that the right in question is guaranteed effectively and rapidly in respect of other claimants affected by the expropriation of property, in accordance with the principles of the protection of pecuniary rights set forth in Article 1 of Protocol No. 1, in particular the principles applicable to compensation arrangements (see paragraphs 93-98 above).\n\n2.  The excessive length of the proceedings\n\n238.  Hundreds of cases are currently pending before the Court in respect of awards made by the courts of appeal in “Pinto” proceedings prior to the Court of Cassation’s departure from precedent and/or the delay in payment of the amounts in question. The Court, while acknowledging with satisfaction the favourable developments in Italian case-law, and particularly the recent judgment of the plenary Court of Cassation (see paragraph 68 above), regrets to observe that, where a deficiency that has given rise to a violation has been put right, another one related to the first one appears: in the present case the delay in executing decisions. It cannot overemphasise the fact that States must equip themselves with the means necessary and adequate to ensure that all the conditions for providing effective justice are guaranteed.\n\n239.  In its Recommendation Rec(2004)6 of 12 May 2004, the Committee of Ministers welcomed the fact that the Convention had become an integral part of the domestic legal order of all States Parties while recommending that member States ensure that domestic remedies existed and were effective. In that connection the Court would stress that although the existence of a remedy is necessary it is not in itself sufficient. The domestic courts must also be able, under domestic law, to apply the European case-law directly and their knowledge of this case-law has to be facilitated by the State in question.\n\nThe Court refers in this regard to the contents of the Recommendations of the Committee of Ministers on the publication and dissemination in the member States of the text of the European Convention on Human Rights and of the case-law of the European Court of Human Rights (Rec(2002)13 of 18 December 2002) and on the European Convention on Human Rights in university education and professional training (Rec(2004)4 of 12 May 2004), not forgetting the Resolution of the Committee of Ministers (Res(2002)12) setting up the  and the fact that at the Warsaw Summit in May 2005 the heads of State and government of the member States decided to develop the evaluation and assistance functions of the CEPEJ.\n\nIn the above-mentioned Recommendation Rec(2004)6 of 12 May 2004, the Committee of Ministers also reiterated that the States have the general obligation to solve the problems underlying violations found.\n\n240.  While reiterating that the respondent State remains free, subject to monitoring by the Committee of Ministers, to choose the means by which it will discharge its legal obligation under Article 46 of the Convention, provided that such means are compatible with the conclusions set out in the Court’s judgment (see Broniowski, cited above, § 192) and without seeking to determine what measures may be taken by the respondent State in order to comply with its obligations under Article 46 of the Convention, the Court would draw its attention to the conditions indicated above (see paragraphs 173-216) regarding the possibility for a person to continue to claim to be a “victim” in this type of case.\n\nThe Court invites the respondent State to take all measures necessary to ensure that the domestic decisions are not only in conformity with the case-law of this Court but are also executed within six months of being deposited with the registry.\n\nB.  Article 41 of the Convention\n\n241.  Article 41 of the Convention provides:\n\n“If the Court finds that there has been a violation of the Convention or the Protocols thereto, and if the internal law of the High Contracting Party concerned allows only partial reparation to be made, the Court shall, if necessary, afford just satisfaction to the injured party.”\n\n1.  Pecuniary damage\n\n(a)  The Chamber judgment\n\n242.  In its judgment (§§ 111-12), the Chamber held:\n\n“The Court has found that the expropriation of the applicants’ property satisfied the condition of lawfulness and was not arbitrary. The act of the Italian government which the Court has held to be contrary to the Convention was an expropriation that would have been legitimate but for the failure to pay reasonable compensation. Nor has the Court concluded that the 20% tax deduction was unlawful as such, but has taken this factor into consideration in assessing the case. Lastly, the Court has found a violation of the applicants’ right to a fair trial on account of the application of section 5 bis to their case.\n\nHaving regard to those factors, and making its assessment on an equitable basis, the Court considers it reasonable to award the applicants EUR 410,000.”\n\n(b)  Submissions of those appearing before the Court\n\n(i)  The applicants\n\n243.  The applicants claimed an amount corresponding to the difference between the compensation that they would have received under Law no. 2359/1865 and the amount that was awarded them in accordance with section 5 bis of Law no. 359/1992. That sum amounted to EUR 123,815.56 in 1983, the year of the expropriation. To that amount should be added statutory compound interest up to 2005 (EUR 297,849.76) and indexation (EUR 198,737.84). Thus, the capital indexed in 2005 and interest accrued amounts to EUR 620,403.16. The applicants criticised the Chamber judgment for failing to award them interest.\n\n244.  The applicants also claimed reimbursement of the 20% tax which had been deducted from the compensation for expropriation, which sum should be index-linked and bear interest up to 2005. The amount came to EUR 137,261.34.\n\n(ii)  The Government\n\n245.  The Government submitted that, in the light of their submissions on the merits, no sum should be awarded under Article 41 of the Convention. Should the Court disagree, the Government submitted that just satisfaction should be limited to an amount calculated with the utmost care, and should certainly be lower than the amount determined by the Chamber and the market value of the land.\n\n(c)  The Court’s assessment\n\n246.  The Court reiterates that a judgment in which it finds a breach imposes on the respondent State a legal obligation to put an end to the breach and make reparation for its consequences in such a way as to restore as far as possible the situation existing before the breach (see Iatridis v. Greece (just satisfaction) [GC], no. 31107/96, § 32, ECHR 2000-XI).\n\n247.  The Contracting States that are parties to a case are in principle free to choose the means whereby they will comply with a judgment in which the Court has found a breach. This discretion as to the manner of execution of a judgment reflects the freedom of choice attached to the primary obligation of the Contracting States under the Convention to secure the rights and freedoms guaranteed (Article 1). If the nature of the breach allows of restitutio in integrum, it is for the respondent State to effect it, the Court having neither the power nor the practical possibility to do so itself. If, on the other hand, national law does not allow – or allows only partial – reparation to be made for the consequences of the breach, Article 41 empowers the Court to afford the injured party such satisfaction as appears to it to be appropriate (see Brumărescu v. Romania (just satisfaction) [GC], no. 28342/95, § 20, ECHR 2001-I).\n\n248.  The Court has held that the interference in question satisfied the condition of lawfulness and was not arbitrary (see paragraph 81 above). The act of the Italian government which the Court held to be contrary to the Convention was an expropriation that would have been legitimate but for the failure to pay fair compensation (see paragraphs 99-104 above). Furthermore, the Court has found that the retrospective application of section 5 bis of Law no. 359/1992 deprived the applicants of the possibility afforded by section 39 of Law no. 2359/1865, applicable to the present case, of obtaining compensation at the market value of the property (see paragraphs 127-33 above).\n\n249.  In the present case the Court considers that the nature of the violations found does not allow it to assume that restitutio in integrum can be made (contrast Papamichalopoulos and Others v. Greece (Article 50), 31 October 1995, Series A no. 330-B). An award of equivalent compensation must therefore be made.\n\n250.  The lawfulness of such a dispossession inevitably affects the criteria to be used for determining the reparation owed by the respondent State, since the pecuniary consequences of a lawful expropriation cannot be assimilated to those of an unlawful dispossession (see The former King of Greece and Others (just satisfaction), cited above, § 75).\n\n251.  The Court adopted a very similar position in Papamichalopoulos and Others (Article 50) (cited above, §§ 36 and 39). It found a violation in that case on account of a de facto unlawful expropriation (occupation of land by the Greek Navy since 1967) which had lasted for more than twenty-five years on the date of the principal judgment delivered on . The Court accordingly ordered the  to pay the applicants, for damage and loss of enjoyment since the authorities had taken possession of the land, an amount corresponding to the current value of the land, increased by the appreciation brought about by the existence of buildings which had been erected since the land had been occupied.\n\n252.  The Court followed that approach in two Italian cases concerning expropriations that did not comply with the principle of lawfulness. In the first of those cases (Belvedere Alberghiera S.r.l. v. Italy (just satisfaction), no. 31524/96, §§ 34-36, 30 October 2003), it held:\n\n“As it is the inherent unlawfulness of the expropriation which was at the origin of the breach found, the compensation must necessarily reflect the full value of the property.\n\nWith regard to pecuniary damage, the Court therefore holds that the compensation to be awarded to the applicant is not limited to the value of the property when it was occupied. For that reason, it requested the expert to estimate also the current value of the land in issue and the other heads of damage.\n\nThe Court decides that the State shall pay the applicant the current value of the land. To that amount shall be added a sum for loss of enjoyment of the land since the authorities took possession of it in 1987 and for the depreciation of the property. Furthermore, in the absence of comments from the Government on the expert report, an amount shall be awarded for loss of income from the hotel activity.”\n\n253.  In the second of those cases (Carbonara and Ventura v. Italy (just satisfaction), no. 24638/94, §§ 40-41, ), the Court declared:\n\n“With regard to pecuniary damage, the Court therefore holds that the compensation to be awarded to the applicants is not limited to the value of their property when it was occupied. For that reason, it requested the expert to estimate also the current value of the land in issue. That value does not depend on hypothetical conditions, which would be the case if it was now in the same condition as in 1970. It is clear from the expert report that, since then, the land and its immediate surroundings – whose situation gave them potential in terms of urban development – have increased in value as a result of the construction of buildings, including a school.\n\nThe Court decides that the State shall pay the applicants, for damage and loss of enjoyment since the authorities took possession of the land in 1970, the current value of the land plus the appreciation gained by the existence of the building.\n\nAs to the determination of the amount of that compensation, the Court adopts the findings in the expert report for the exact assessment of the damage sustained. That sum amounts to EUR 1,385,394.60.”\n\n254.  An analysis of the three above-mentioned cases, which all concern cases of inherently unlawful dispossession, shows that, in order to fully compensate the loss incurred, the Court has awarded amounts taking account of the current value of land in the light of today’s property market. It has also sought to compensate financial loss by taking account of the potential of the land in question, calculated, if applicable, on the basis of the construction costs of buildings put up by the expropriating authority.\n\n255.  Contrary to the amount awarded in the cases referred to above, the compensation to be determined in the present case will not have to reflect the idea of a total elimination of the consequences of the impugned interference. Indeed, in the present case it is the lack of adequate compensation and not the inherent unlawfulness of the taking of the land that was at the origin of the violation found under Article 1 of Protocol No. 1.\n\n256.  In determining the amount of adequate compensation, which does not necessarily have to reflect the full value of the property, the Court must base itself on the criteria laid down in its judgments regarding Article 1 of Protocol No. 1 and according to which, without payment of an amount reasonably related to its value, a deprivation of property would normally constitute a disproportionate interference which could not be considered justifiable under Article 1 of Protocol No. 1 (see James and Others, cited above, § 54). The Court reiterates that in many cases of lawful expropriation, such as a distinct expropriation of land with a view to building a road or for other purposes “in the public interest”, only full compensation can be regarded as reasonably related to the value of the property (see The former King of Greece and Others (just satisfaction), cited above, § 78). However, legitimate objectives of “public interest”, such as those pursued by measures of economic reform or measures designed to achieve greater social justice, may call for less than reimbursement of the full market value (ibid.).\n\n257.  In the instant case the Court has found that a “fair balance” was not struck, given the level of compensation well below the market value of the land and given the lack of “public interest” grounds justifying a departure from the rule set forth in paragraph 95 above, according to which, in the absence of such grounds, and in the event of a “distinct expropriation”, adequate compensation has to correspond to the value of the property (see paragraphs 99-104 above).\n\nIt follows that adequate expropriation compensation in the present case should have corresponded to the market value of the property. Consequently, the Court will award compensation corresponding to the difference between the value of the land and the compensation obtained by the applicants at national level.\n\n258.  Like the Chamber, the Grand Chamber considers it appropriate to base itself on the value of the property at the time of the expropriation, as stated in the court-ordered expert reports drawn up during the domestic proceedings (165,755 Italian lire (ITL) per square metre in 1983 – see paragraphs 32 and 37 above) and on which the applicants based their claims (see paragraphs 243-44 above). As the adequacy of the compensation would be diminished if it were to be paid without reference to various circumstances liable to reduce its value, such as the lapse of a considerable period of time (see Stran Greek Refineries and Stratis Andreadis, cited above, § 82, and, mutatis mutandis, Motais de Narbonne v. France (just satisfaction), no. 48161/99, §§ 20-21, 27 May 2003), once the amount obtained at domestic level is deducted, and the difference with the market value of the land in 1983 thus obtained, that amount will have to be converted to current value to offset the effects of inflation. Moreover, interest will have to be paid on this amount so as to offset, at least in part, the long period for which the applicants have been deprived of the land. In the Court’s opinion the interest should take the form of simple statutory interest applied to the capital progressively adjusted. With regard, lastly, to the 20% tax deducted from the expropriation compensation awarded at domestic level, the Grand Chamber, like the Chamber, has not found the application of that tax to be unlawful as such but has taken account of that factor in assessing the facts (see paragraph 101 above).\n\n259.  Having regard to those factors, and ruling on an equitable basis, the Court considers it reasonable to award the applicants EUR 580,000, plus any tax that may be chargeable on that amount.\n\n2.  Non-pecuniary damage as a result of the length of the proceedings\n\n(a)  The Chamber judgment\n\n260.  In its judgment, the Chamber held that, on this point, the question of the application of Article 41 was not ready for decision and reserved it (see paragraph 115 of the Chamber judgment).\n\n(b)  Submissions of those appearing before the Court\n\n(i)  The applicants\n\n261.  The applicants estimated at EUR 6,000 the compensation for the non-pecuniary damage sustained by each of them on account of the length of the proceedings, that is, EUR 24,000 in total.\n\n(ii)  The Government\n\n262.  The Government had no objection in principle to the Court specifying the criteria for non-pecuniary damage regarding this type of violation, and asked it to indicate that the amount of just satisfaction had to be calculated solely by reference to the delays beyond the reasonable time and for which the State was responsible. They also asked the Court to hold that the criteria for calculating compensation should not be limited to determining a particular sum per year, but that regard had to be had to other factors, including the stakes involved and the outcome of the case.\n\n263.  With regard to the present case, the Government confined themselves to observing that no amount should be awarded under Article 41.\n\n(c)  Third-party interveners\n\n(i)  The Czech Government\n\n264.  As the Czech Government had decided, in addition to introducing a preventive remedy, to enact a law providing for a compensatory remedy, they felt obliged to propose a law that would be sufficiently foreseeable. They referred to difficulties in that regard, submitting that neither the Convention nor the Court’s case-law provided sufficient clarification. They requested more information about the criteria used by the Court, cases that could be regarded as “similar” and the threshold level of the “reasonable” relation.\n\n(ii)  The Polish Government\n\n265.  In the Polish Government’s submission, the Court should indicate what just satisfaction consisted of. If precise indications were not given, inconsistencies were likely to arise between domestic case-law and the Court’s case-law. Applicants and Governments alike would find it very difficult to establish general rules concerning just satisfaction from the Court’s case-law. Accordingly, the domestic courts were not in a position to rely on the Court’s case-law and make decisions compatible with it.\n\n(iii)  The Slovakian Government\n\n266.  In the Slovakian Government’s submission, the considerations on which the Court based its determination of non-pecuniary damage should form part of the reasons for its decision. It was only in that way that the Court’s judgments would become clear instructions for the domestic courts when it came to determining awards in respect of non-pecuniary damage caused by delays in the proceedings.\n\nIn the Slovakian Government’s submission, it was impossible to translate all these aspects into figures or to foresee every situation which might arise. The Slovakian Government did not expect the Court to define a precise formula by which the amount awarded for non-pecuniary damage flowing from the protractedness of proceedings could be calculated or to determine precise amounts. It was, in their view, more important that the Court gave sufficient justification in its decisions for the manner in which the criteria to which regard was had when assessing the reasonableness of the length of the proceedings were then taken into account to determine the amount awarded for non-pecuniary damage arising from the delays in the proceedings. It was clear from the foregoing that applicants should be awarded the same amount in comparable cases.\n\n(d)  The Court’s criteria\n\n267.  In reply to the Governments, the Court states at the outset that by “similar cases” it means any two sets of proceedings that have lasted for the same number of years, for an identical number of levels of jurisdiction, with stakes of equivalent importance, much the same conduct on the part of the applicant and in respect of the same country.\n\nMoreover, it shares the Slovakian Government’s view that it would be impossible and impracticable to try to provide a list of detailed explanations covering every eventuality and considers that all the necessary elements can be found in its previous decisions available in the Court’s case-law database.\n\n268.  It indicates next that the amount it will award under the head of non-pecuniary damage under Article 41 may be less than that indicated in its case-law where the applicant has already obtained a finding of a violation at domestic level and compensation by using a domestic remedy. Apart from the fact that the existence of a domestic remedy is fully in keeping with the subsidiarity principle embodied in the Convention, such a remedy is closer and more accessible than an application to the Court, is faster and is processed in the applicant’s own language; it thus offers advantages that need to be taken into consideration.\n\n269.  The Court considers, however, that where an applicant can still claim to be a “victim” after making use of that domestic remedy he or she must be awarded the difference between the amount obtained from the court of appeal and an amount that would not have been regarded as manifestly unreasonable compared with the amount awarded by the Court if it had been awarded by the court of appeal and paid speedily.\n\n270.  Applicants should also be awarded an amount in respect of stages of the proceedings that may not have been taken into account by the domestic courts in the reference period where they can no longer take the case back before the court of appeal seeking application of the change of position adopted by the Court of Cassation on 26 January 2004 (see its judgment no. 1339 – paragraph 64 above) or the remaining length was not in itself sufficiently long to be regarded as amounting to a second violation in respect of the same proceedings.\n\n271.  Lastly, the Government should be ordered to pay a further sum where the applicant has had to endure a delay while waiting for payment of the compensation due from the State so that the frustration arising from the delay in obtaining payment is offset.\n\n(e)  Application of the foregoing criteria to the present case\n\n272.  Having regard to the circumstances of the present case (see paragraphs 220-21 above), the Court considers that, in the absence of domestic remedies, it would have awarded the sum of EUR 24,000. It notes that the applicants were awarded EUR 2,450 by the Court of Appeal, which is approximately 10% of what the Court would have awarded them. In the Court’s view, this factor in itself leads to a result which is manifestly unreasonable having regard to the criteria established in its case-law.\n\nHaving regard to the characteristics of the domestic remedy chosen by  and the fact that, notwithstanding this national remedy, the Court has found a violation, it considers, ruling on an equitable basis, that the applicants should be awarded EUR 8,400.\n\nAs no relevant allegations have been made, no amount should be added on account of any “further frustration” that may have been caused by the delay in paying the amount due from the State.\n\n273.  Accordingly, the applicants are entitled to compensation for non-pecuniary damage in a total sum of EUR 8,400, that is, EUR 2,100 each, plus any tax that may be chargeable on that amount.\n\n3.  Non-pecuniary damage in respect of the other violations found\n\n(a)  The Chamber judgment\n\n274.  In its judgment, the Chamber held that, on this point, the question of the application of Article 41 was not ready for decision and reserved it (see paragraph 115 of the Chamber judgment).\n\n(b)  Submissions of those appearing before the Court\n\n(i)  The applicants\n\n275.  The applicants claimed EUR 6,500 each in compensation for the non-pecuniary damage stemming from the unfairness of the proceedings and the interference with their right to the peaceful enjoyment of their possessions. In total, the applicants therefore claimed EUR 26,000 under the head of non-pecuniary damage for these violations.\n\n(ii)  The Government\n\n276.  The Government did not submit any observations on this issue.\n\n(c)  The Court’s assessment\n\n277.  The Court considers that the applicants must have suffered some non-pecuniary damage as a result of the unjustified interference with their right to the peaceful enjoyment of their possessions and the unfairness of the proceedings which cannot be sufficiently compensated by the findings of violations.\n\n278.  Having regard to the facts of the case, and ruling on an equitable basis, the Court awards the applicants EUR 1,000 each under this head, that is, a total of EUR 4,000, plus any tax that may be chargeable on that amount.\n\n4.  Costs and expenses\n\n(a)  The Chamber judgment\n\n279.  The Chamber reserved the question of just satisfaction on this point.\n\n(b)  Submissions of those appearing before the Court\n\n(i)  The applicants\n\n280.  Submitting documentary evidence in support of their claim, the applicants assessed at EUR 16,355.99 the costs and expenses incurred in the domestic proceedings, of which EUR 1,500 corresponded to the part of the costs payable by them in the proceedings brought under the Pinto Act (see paragraph 45 above).\n\n281.  With regard to the costs incurred in the proceedings before the Court, the applicants submitted a bill of costs and expenses drawn up on the basis of the applicable national rates and sought reimbursement of EUR 46,313.70 for the proceedings up to adoption of the Chamber judgment. To that sum should be added EUR 19,705, including the costs and expenses incurred before the Grand Chamber.\n\n(ii)  The Government\n\n282.  The Government confined themselves to observing that in the proceedings instituted under the Pinto Act the applicants had to bear some of the costs on account of taking legal action against a defendant who should not have been a party to the proceedings.\n\n(c)  The Court’s assessment\n\n283.  According to the Court’s settled case-law, costs and expenses will not be awarded under Article 41 unless it is established that they were actually incurred, were necessarily incurred and are also reasonable as to quantum. Furthermore, legal costs are only recoverable in so far as they relate to the violation found (see, for example, Beyeler v. Italy (just satisfaction) [GC], no. 33202/96, § 27, , and Sahin v. Germany [GC], no. 30943/96, § 105, ECHR 2003VIII).\n\n284.  As the applicants’ case before the domestic courts was essentially aimed at remedying the violations of the Convention alleged before the Court, these domestic legal costs may be taken into account in assessing the claim for costs. However, the Court considers the amount claimed in fees to be too high.\n\n285.  As regards the costs and expenses incurred in the Strasbourg proceedings, the Court has found a violation of Article 1 of Protocol No. 1 and a double violation of Article 6 § 1 of the Convention, thus agreeing with the applicants’ submissions.\n\nWhilst the Court does not doubt that the costs claimed were necessarily and actually incurred, and acknowledges the length and precision of the pleadings submitted by the applicants and the large amount of work done on their behalf, it does however find the fees claimed to be excessive. The Court therefore considers that they should be reimbursed only in part.\n\n286.  Having regard to the facts of the case, the Court awards the applicants EUR 50,000 in total for all the costs incurred before the domestic courts and in Strasbourg, plus any tax that may be chargeable on that amount.\n\n5.  Default interest\n\n287.  The Court considers it appropriate that the default interest should be based on the marginal lending rate of the European Central Bank, to which should be added three percentage points.\n\nFOR THESE REASONS, THE COURT UNANIMOUSLY\n\n1.  Holds that there has been a violation of Article 1 of Protocol No. 1 on account of the inadequate amount of compensation for expropriation;\n\n2.  Holds that there is no need to examine under Article 1 of Protocol No. 1 the complaint based on the retrospective application to the present case of section 5 bis of Law no. 359/1992;\n\n3.  Holds that there has been a violation of Article 6 § 1 of the Convention on account of the application to the present case of section 5 bis of Law no. 359/1992;\n\n4.  Dismisses the Government’s preliminary objection as to the non-exhaustion of domestic remedies in respect of the complaint about the length of the proceedings;\n\n5.  Holds that the applicants can claim to be “victims”, for the purposes of Article 34 of the Convention, of a violation of the “reasonable time” principle;\n\n6.  Holds that there has been a violation of Article 6 § 1 of the Convention on account of the length of the proceedings;\n\n7.  Holds\n\n(a)  that the respondent State is to pay the applicants, within three months, the following amounts:\n\n(i)  EUR 580,000 (five hundred and eighty thousand euros) in respect of pecuniary damage;\n\n(ii)  EUR 8,400 (eight thousand four hundred euros) plus EUR 4,000 (four thousand euros), that is, a total of EUR 12,400 (twelve thousand four hundred euros) for nonpecuniary damage;\n\n(iii)  EUR 50,000 (fifty thousand euros) for costs and expenses;\n\n(iv)  any tax that may be chargeable on the above amounts;\n\n(b)  that from the expiry of the above-mentioned three months until settlement simple interest shall be payable on the above amounts at a rate equal to the marginal lending rate of the European Central Bank during the default period plus three percentage points;\n\n8.  Dismisses the remainder of the applicants’ claim for just satisfaction.\n\nDone in English and in French, and delivered at a public hearing in the Human Rights Building, , on .\n\n\t  Early\tLuzius Wildhaber\n\tDeputy Registrar\tPresident"}